{
  "News": [
    "GZ6G Technologies Completes Build-Out of Orange County Office, Adds 25 Staff Members in Past 15 Months",
    "GZ6G Technologies Issues Statement Regarding Unauthorized Stock Promotion",
    "GZ6G Technologies Expands Software Development Team with Key Hires",
    "GZ6G Technologies Appoints PondelWilkinson to Lead Investor Relations Program",
    "GZ6G Technologies’ Media Sponsorship Opportunities Expand for National and Local Brands, Following Installation of Smart Solutions at MidAmerican Energy RecPlex in West Des Moines, Iowa",
    "GZ6G Technologies Advances FiBox Pro—Smart WiFi 6 Large Area Gateway with Built-In Captive Portal—Through Green Zebra Labs Division",
    "GZ6G Technologies Integrates Smart City and Smart Venue Cybersecurity Through Green Zebra Networks, as Cyber Attacks Run Rampant Nationwide",
    "GZ6G Technologies Announces Partnership With Digideck, Cloud-Based Presentation Platform",
    "GZ6G Technologies Expands Managed Services Capabilities With Certified Network Engineer, Altabakh",
    "GZ6G Technologies (GZIC) Hires Dudenhoeffer as Director of Sponsorships, Brands, and Large Venue Media",
    "GZ6G Technologies Hires Helen Young as Director of Operations and IT Wireless Managed Network Services",
    "GZ6G Technologies Provides Q3 Highlights and Q4 Innovation and Operational Plans: OTCMarkets: OTCQB - Symbol GZIC",
    "OTC Markets Group Welcomes New OTCQB Companies – October 25",
    "GZ6G Technologies Announces Uplist to OTCQB Venture Market",
    "GZ6G Technologies Corp. (OTCMARKETS: GZIC) Announces Smart Technology Installation Complete at MidAmerican Energy RecPlex for the City of West Des Moines, Iowa",
    "GZ6G Technologies Corp (OTCMARKETS: GZIC) Form S-1 Registration Statement Has Been Declared Effective by the US Securities and Exchange Commission (“SEC”) as of September 24, 2021",
    "GZ6G Technologies Hires Daniela Bittner as Director of Government Procurement",
    "GZ6G Technologies’ Green Zebra Smart Networks Division Showroom Soft Opening Scheduled For Wednesday, September 8",
    "GZ6G Technologies Hires Peter Malecha as Director of Digital Marketing for GZ6G Technologies",
    "GZ6G Technologies Announces OTCQB Uplisting Application Has Been Finalized and Welcomes William Procanik and Scott Hale to Board of Directors ",
    "GZ6G Technologies Appoints Larry De Cair as Smart Solutions Architect for Green Zebra Smart Networks",
    "GZ6G Technologies’ Green Zebra Smart Networks Division Launches Phase One of New Website: GZSmartNetworks.com",
    "GZ6G Technologies Green Zebra Smart Labs Division to Offer Innovative Products, Services and Software Applications for Enterprise Clients ",
    "GZ6G Technologies’ Green Zebra Smart Networks Division to Offer Local Information Technology, Wireless Network and Cyber Security Services",
    "GZ6G Technologies’ Green Zebra Smart Media Now Hiring for Key Marketing Positions",
    "GZ6G Technologies Now Hiring Tech Talent for Green Zebra Smart Networks",
    "GZ6G Technologies Expansion Continues with Opening of New Regional West Coast Office in Irvine, California ",
    " GZ6G Technologies Announces Rebranding and Refresh of Logos for Divisions",
    "GZ6G Technologies Submits Application to Uplist to OTCQB",
    "GZ6G Technologies Tapped as MidAmerican Energy Company Recplex’s Public Wi-Fi Platform Partner for Marketing, Communications, and Digital Advertising ",
    "GZ6G Technologies Ready to Uplist to OTCQB",
    "GZ6G Technologies Introduces VITEC’s IPTV & Digital Signage Technology to Customers",
    "GZ6G Technologies Appoints Eloisa Tobias as Director of Smart Solutions for the  Green Zebra Networks Division",
    "GZ6G Technologies Introduces Green Zebra Data Centers Division ",
    "GZ6G Technologies Appoints Rohan Patange as Interim Chief Technology Officer",
    "GZ6G Technologies Partners with Internet Soft for Software Development & Engineering Services",
    "GZ6G Technologies Announces Development of Innovative Artificial Intelligence Analytics platform VenuTrax for launch by Green Zebra Smart Labs",
    "GZ6G Technologies Introduces the Green Zebra Smart Labs Division",
    "GZ6G Technologies Appoints Wendy Ramirez as Vice President of Human Resources",
    "GZ6G Establishing Managed Services and Data Center to Serve the Emerging 5G & WiFi-6 Market Demands",
    "GZ6G Controlled Subsidiary, Green Zebra Media Corp. Taps BRAND for Strategic Partnership",
    "GZ6G Technologies Corp. Retains Auditor & Securities Counsel to Complete 2020/2019 Fiscal Audits & Registration Statement to Become Fully Reporting With Securities and Exchange Commission, Next Step Towards Up Listing to OTCQB Q2 2021",
    "Green Zebra Media Corp. Announces System for Award Management (SAM) Registration Through US Federal Contractor Registration (USFCR) is Complete",
    "Green Zebra Media, Majority-Controlled Subsidiary of GZ6G Technologies Corp., Relocating HQ to Las Vegas, Nevada",
    "Green Zebra Media Corp., Majority Controlled Subsidiary of GZ6G Technologies, Announces 2021 Corporate Mandate",
    "GZ6G Technologies Corp. (OTCMarkets: GZIC) Shareholder Update",
    "Green Zebra International Corp. announces Reverse Split, Name Change and Corporate Update",
    "Green Zebra International Corp - Corporate update",
    "Uptick Newswire Hosts Green Zebra International Corp. on The Stock Day Podcast to Discuss Opportunities for Growth",
    "Punta Mita Exclusive Resorts Community Mexico Expands Green Zebra (OTC: GZIC) Wireless & IOT WiFi Monetization’s Services",
    "Green Zebra International Corp. Announces Ticker Symbol & Name Change from Nanosensors, Inc. (OTC: NNSR) to Green Zebra International Corp. (OTC: GZIC)",
    "Green Zebra, a subsidiary of NanoSensors, Inc. (OTCBB: NNSR) announces 4th qtr. smartMedia WiFi revenue forecast for smartAirports, smartStadiums and smartCities",
    "NanoSensors,Inc.(OTCBB: NNSR)Announces Acquisition of Green Zebra Media Corp,a leading wireless marketing & data analytics agency focused on smartTechnology and sponsor solutions for the location-based smartCities and smartVenues worldwide.",
    "Nanosensors, Inc. (OTCBB: NNSR) SmartCities, IOT & Wireless 5G/6G Announces Acquisitions & Plans for Expansion",
    "GZ6G Technologies Completes Build-Out of Orange County Office, Adds 25 Staff Members in Past 15 Months",
    "GZ6G Technologies Issues Statement Regarding Unauthorized Stock Promotion",
    "GZ6G Technologies Expands Software Development Team with Key Hires",
    "GZ6G Technologies Appoints PondelWilkinson to Lead Investor Relations Program"
  ]
}
