{
  "Title": "I want to buy gold. What's my best option?",
  "Description": "Budget is $5000 USD, I live in Chicago. I've been meaning to buy for a while now, but its becoming obvious that I don't really know what I'm doing. Originally I was going to just go for straight 1 oz bars from apmex or jm  bullion, but I've had issues with deliveries in the past and I definitely didn't want to lose a $1850 package (now more like $2050. I have regrets). So:",
  "Comments": [
    "Budget is $5000 USD, I live in Chicago. I've been meaning to buy for a while now, but its becoming obvious that I don't really know what I'm doing. Originally I was going to just go for straight 1 oz bars from apmex or jm  bullion, but I've had issues with deliveries in the past and I definitely didn't want to lose a $1850 package (now more like $2050. I have regrets). So:",
    "-are these sites reliable?",
    "-is there a local option I could use?",
    "-is there a better way to split my budget besides buying straight bars?",
    "Although there nothing wrong with bars, I would advise you to buy coins. As a seller I avoid bars like the plague. The demand for coins is exponentially more than the demand for bars. When I first started out I went the bar route and learned the hard way to  not buy them.",
    "The best bang for your buck is old gold coins. British sovereigns, swiss francs, belgian francs, French francs, Italian lira, Austrian Corona, austrian ducats, gold pesos, gold roubles, the list is endless. Look at my post history to see first hand the demand old gold coins have. Its night and day.",
    "I considered buying old coins but I don't want to get too attached. If I ever got my hands on a gold Napoleon I doubt I could ever bring myself to sell it.",
    " SDBullion. Check you LCS compare pricing with the online dealers.",
    "I personally like coins because coins sell better (IMHO) when I was first stacking gold I would buy coins with lowest premium. Everyone can look up pure gold content in 3 seconds. Lowest premium coins are British Sovereigns, French Francs, Swiss Francs or USA commemorative $5.00 gold coins. All of these used to sell for melt and now r more but nowhere near the premiums that the others sell for. Here is the negative, when u sell them they will only sell for melt. If u r betting gold will rise then it’s a good option.",
    "You can get a 1oz gold US coin at a local coin shop for $2050",
    "Local coin shops would be the way to go I guess",
    "I use apmex. I haven’t had issues. But if I lived in a apartment I would not be confident of my purchase being delivered correctly.",
    "Morton Grove Coins & Collectibles in the suburbs always has a good selection of gold available. Price is generally on par with all of the major online dealers.",
    "The larger PM companies are usually privately or self insured for losses by delivery companies. That isn't a large concern for me. They all seem to have delivery delays due to shortages right now.",
    "As others have pointed out, the liquidity of coins is usually greater than bars. Always buy with the end game in mind.",
    "(in the U.S.) The sovereigns, most 20 Francs, U.S. commemorative and First Spouse gold coins are some of the lowest priced gold coins per oz. of gold being currently offered. They may also return the least premium back to you... assuming there are ready buyers.",
    "First thing, know what the spot price of gold is daily. That way you don’t get ripped off. Check on Reddit groups and Facebook groups for buys. If you feel like you have to buy from an online retailer, use someone like apmex or jmbouillon. Try to find gold that is closest to spot price as you can.",
    "I prefer to buy gold coins not bars because the ones I buy are made by government mints, these are the most reliable, they are the easiest to sell and they also get the highest premiums. I prefer American Gold Eagles and Buffalos but also have Maple Leafs and Krugerands. The best price (lowest premiums) are from my Local Coin Shop, they are always used but usually in excellent condition. Nowadays the selection is usually very limited but is constantly changing. Visit your local coin stores, talk to the owners, you will see who you like and trust the most.",
    "Harbor Coin in Waukegan has been good to me. Fair prices, decent inventory. Prices have generally been comparable or better than the online guys.",
    "Illinois has no taxes on silver and gold, which is surprising since they tax and toll on everything else. So you have that going in your favor.",
    "The advantages of an LCS are that you can look, handle, and take home same day. No worries about six week wait times or stuff getting stolen or lost.",
    "Local coin shops are good when you have cash that you are trying to turn to gold or silver. Wink wink , you should definitely absolutely report those CASH ,big purchases to the irs . Apmex and jm bullion are reliable but it leaves a paper trail if u know what I mean",
    "1: I'd go for coins over bars. Coins are more difficult to counterfeit than bars, which means bars are more easily and therefore are more often counterfeited. It should be easier to sell a coin when the time comes.",
    "2: The big websites (JM, Apmex, etc) are absolutely trustworthy. If you're having issues with packages being delivered then maybe consider buying a coin in person from a local coin shop. Since you're in a big city you should have plenty to choose from.",
    "3: Consider buying silver and/or platinum in addition to gold. Gold is currently under priced compared to its value, but silver and platinum are even more under priced than gold is. A kilo bar of silver is about $1,000 and an ounce of gold is about $2,000, so maybe 2ozt gold and 1 kilo of silver or some other combination of the two.",
    "Coins seem to be the consensus, so I'll probably go that route. They're nicer to look at anyways.",
    "How does silver compare practically? I was under the impression that silver doesn't sell/store as well as gold."
  ]
}
{
  "Title": "Saw these quotes about gold in an art museum and thought you all would enjoy them",
  "Description": "True words right there.",
  "Comments": [
    "True words right there.",
    "I don't agree with the second quote. Money isn't the root of all evil; it's the ",
    " that's the root of all evil."
  ]
}
{
  "Title": "Increase of jewelry gold vs real gold",
  "Description": "Hello fellow good lovers Recently I decided to buy a piece of jewelry (2.3 grams 18 karats ) the original price was 280 dollars but through negotiations it decreased to about 180 dollars , my question is this increase (87 % increase) normal if not what’s the average increase of gold jewelry vs actual gold",
  "Comments": [
    "Hello fellow good lovers Recently I decided to buy a piece of jewelry (2.3 grams 18 karats ) the original price was 280 dollars but through negotiations it decreased to about 180 dollars , my question is this increase (87 % increase) normal if not what’s the average increase of gold jewelry vs actual gold",
    "Check mene gold website for info on typical margin.",
    "Mene is not going to give you info on typical premium. Mene sells 24k at the same price per gram that most US jewelers sell 18k.",
    "I'm just a casual jewelry browser, but I find that it varies a lot based on the piece (e.g. ring, chain, etc.) and how it's made (machined, handmade, hand-engraved, etc.). Vintage examples of sought-after brands (e.g. Tiffany & Co.) will carry higher premiums, as you'd probably expect.",
    "I just looked at Jacoje, a fairly popular online retailer of chains and other solid gold jewelry. He's selling an 18k machine-made link chain that weighs 4.6 grams (twice the weight of your item) for $310. Probably not an apples-to-apples comparison, though...",
    "Oh, I've also read (though I don't know firsthand) that this tends to vary by country/region. From what I understand, hefty premiums are pretty standard in North America and Europe (where gold jewelry is usually 14k-18k) but are often much lower in Asian countries (where jewelry is often 22k+).",
    "As another commenter mentioned, Mene is a good reference but not a \"typical margin\" for American jewelers.",
    "Typically, new jewelry is going to run 4-6x the intrinsic value of the gold. Consider it an “artisan premium”, though truthfully most jewelry is produced my machine.",
    "If you want to buy jewelry closer to melt value, may I suggest estate (used) jewelry? I regularly buy estate 14k for LESS than the melt value. Sometimes, far far less.",
    "Where do you buy estate jewelry",
    "The word you are looking for is 'margin'.",
    "I don't have the answer, but I know jewellery demands a premium for the labour/ workmanship.",
    "For 14k jewelry I aim to pay no more than $10 over spot price per gram. 24k jewelry can range between $15-$25 over spot per gram."
  ]
}
{
  "Title": "It’s tiny but it’s a start.",
  "Description": "Great start 👍Keep Stacking!",
  "Comments": [
    "Great start 👍Keep Stacking!",
    "Remember man, if all you can afford is silver coins, then stack em. If you can afford some 1/10oz gold coins, stack some of them. Do you pay higher premiums? Sure do... But you can get those same premiums back if you decide to sell.",
    "If not buying 1/10 oz coins. what size bars or rounds would you suggest?",
    "Ain't a competition brother! Noce start, stack that shiny :)",
    "It’s a great start and puts you way ahead of most people.  Great job!"
  ]
}
{
  "Title": "Want to Wipe Whole Teams in Labs? - This Gun is the KEY",
  "Description": null,
  "Comments": []
}
{
  "Title": "Where can I get 22/24k gold jewellery in the UK?",
  "Description": "I love the Mene stuff and I'd love to pick up a pendant and bracelet but I don't think they ship to the UK.",
  "Comments": [
    "I love the Mene stuff and I'd love to pick up a pendant and bracelet but I don't think they ship to the UK.",
    "Do you know where I could get some high purity jewellery without extreme premiums that high Street jewellers seem to charge?",
    "Indian gold shops up north 👍",
    "How far north? Will be taking a trip up there soon actually lol"
  ]
}
{
  "Title": "Want to Wipe Whole Teams in Labs? - This Gun is the KEY",
  "Description": null,
  "Comments": []
}
{
  "Title": "I want to buy gold. What's my best option?",
  "Description": "Budget is $5000 USD, I live in Chicago. I've been meaning to buy for a while now, but its becoming obvious that I don't really know what I'm doing. Originally I was going to just go for straight 1 oz bars from apmex or jm  bullion, but I've had issues with deliveries in the past and I definitely didn't want to lose a $1850 package (now more like $2050. I have regrets). So:",
  "Comments": [
    "Budget is $5000 USD, I live in Chicago. I've been meaning to buy for a while now, but its becoming obvious that I don't really know what I'm doing. Originally I was going to just go for straight 1 oz bars from apmex or jm  bullion, but I've had issues with deliveries in the past and I definitely didn't want to lose a $1850 package (now more like $2050. I have regrets). So:",
    "-are these sites reliable?",
    "-is there a local option I could use?",
    "-is there a better way to split my budget besides buying straight bars?",
    "Although there nothing wrong with bars, I would advise you to buy coins. As a seller I avoid bars like the plague. The demand for coins is exponentially more than the demand for bars. When I first started out I went the bar route and learned the hard way to  not buy them.",
    "The best bang for your buck is old gold coins. British sovereigns, swiss francs, belgian francs, French francs, Italian lira, Austrian Corona, austrian ducats, gold pesos, gold roubles, the list is endless. Look at my post history to see first hand the demand old gold coins have. Its night and day.",
    "I considered buying old coins but I don't want to get too attached. If I ever got my hands on a gold Napoleon I doubt I could ever bring myself to sell it.",
    " SDBullion. Check you LCS compare pricing with the online dealers.",
    "I personally like coins because coins sell better (IMHO) when I was first stacking gold I would buy coins with lowest premium. Everyone can look up pure gold content in 3 seconds. Lowest premium coins are British Sovereigns, French Francs, Swiss Francs or USA commemorative $5.00 gold coins. All of these used to sell for melt and now r more but nowhere near the premiums that the others sell for. Here is the negative, when u sell them they will only sell for melt. If u r betting gold will rise then it’s a good option.",
    "You can get a 1oz gold US coin at a local coin shop for $2050",
    "Local coin shops would be the way to go I guess",
    "I use apmex. I haven’t had issues. But if I lived in a apartment I would not be confident of my purchase being delivered correctly.",
    "Morton Grove Coins & Collectibles in the suburbs always has a good selection of gold available. Price is generally on par with all of the major online dealers.",
    "The larger PM companies are usually privately or self insured for losses by delivery companies. That isn't a large concern for me. They all seem to have delivery delays due to shortages right now.",
    "As others have pointed out, the liquidity of coins is usually greater than bars. Always buy with the end game in mind.",
    "(in the U.S.) The sovereigns, most 20 Francs, U.S. commemorative and First Spouse gold coins are some of the lowest priced gold coins per oz. of gold being currently offered. They may also return the least premium back to you... assuming there are ready buyers.",
    "First thing, know what the spot price of gold is daily. That way you don’t get ripped off. Check on Reddit groups and Facebook groups for buys. If you feel like you have to buy from an online retailer, use someone like apmex or jmbouillon. Try to find gold that is closest to spot price as you can.",
    "I prefer to buy gold coins not bars because the ones I buy are made by government mints, these are the most reliable, they are the easiest to sell and they also get the highest premiums. I prefer American Gold Eagles and Buffalos but also have Maple Leafs and Krugerands. The best price (lowest premiums) are from my Local Coin Shop, they are always used but usually in excellent condition. Nowadays the selection is usually very limited but is constantly changing. Visit your local coin stores, talk to the owners, you will see who you like and trust the most.",
    "Harbor Coin in Waukegan has been good to me. Fair prices, decent inventory. Prices have generally been comparable or better than the online guys.",
    "Illinois has no taxes on silver and gold, which is surprising since they tax and toll on everything else. So you have that going in your favor.",
    "The advantages of an LCS are that you can look, handle, and take home same day. No worries about six week wait times or stuff getting stolen or lost.",
    "Local coin shops are good when you have cash that you are trying to turn to gold or silver. Wink wink , you should definitely absolutely report those CASH ,big purchases to the irs . Apmex and jm bullion are reliable but it leaves a paper trail if u know what I mean",
    "1: I'd go for coins over bars. Coins are more difficult to counterfeit than bars, which means bars are more easily and therefore are more often counterfeited. It should be easier to sell a coin when the time comes.",
    "2: The big websites (JM, Apmex, etc) are absolutely trustworthy. If you're having issues with packages being delivered then maybe consider buying a coin in person from a local coin shop. Since you're in a big city you should have plenty to choose from.",
    "3: Consider buying silver and/or platinum in addition to gold. Gold is currently under priced compared to its value, but silver and platinum are even more under priced than gold is. A kilo bar of silver is about $1,000 and an ounce of gold is about $2,000, so maybe 2ozt gold and 1 kilo of silver or some other combination of the two.",
    "Coins seem to be the consensus, so I'll probably go that route. They're nicer to look at anyways.",
    "How does silver compare practically? I was under the impression that silver doesn't sell/store as well as gold."
  ]
}
{
  "Title": "My first ounce! I'm a big fan of the Credit Suisse bars.",
  "Description": "Very pretty. Apes like shiny things. Me want. What kind of overcharge, was it reasonable?",
  "Comments": [
    "Very pretty. Apes like shiny things. Me want. What kind of overcharge, was it reasonable?",
    "Old skool. 👍",
    "How can I authenticate serial numbers on these pieces? I typed mine in their website but no results.  I sent an email request but to reply.  I feel it might be a security issue to check serial numbers online?",
    "awesome man , congrats",
    "I remember,  eons ago,  how popular the 1gr Credit Suisse gold bar necklace/pendants were amongst the girls... and occasional guys too, mid to late 70s I believe. I always wondered if they were real. They weren't in plastic.",
    "Anyway, I'm a big fan of those too... I have a couple (ounces, not pendants). Good start."
  ]
}
{
  "Title": "Selling gold, online or physical",
  "Description": "Which is the better deal to sell gold --to sell online or jewelry store and what sites do you recommend?",
  "Comments": [
    "Which is the better deal to sell gold --to sell online or jewelry store and what sites do you recommend?",
    "Best you're going to get is online at ",
    "Your local coin shop will probably give you the best price and be the safest option."
  ]
}
{
  "Title": "Onward and Upward for Gold (and Silver)...2021 Precious Metals Mid-Year Outlook",
  "Description": null,
  "Comments": []
}
{
  "Title": "Started stacking December 2020 and been going hard ever since.",
  "Description": "Hell yea",
  "Comments": [
    "Hell yea",
    "Why the variety? I’m curious",
    "I buy off a few people on IG. They have a lot of random things so I just buy whatever I like. Now I am just buying 1oz every 1-2 weeks instead of fractionals.",
    "Strangely, the best place to buy gold for me was wedding bands off Amazon.  The prices are all over the place and a few times I was able to buy for less than scrap.  They would sell a size 8 at $100 for example then sell a size 11 weighing 2 grams more for $70 due to stock, I believe.  My jeweler and I bought out what we could and sold them for scrap.  Weird game.",
    "Whats the diameter on the 1g maples and do they have any detail being so small? Really cool coins just wanted to know",
    "Some people do not play!!"
  ]
}
{
  "Title": "Lunch hour surprise combo platter ... !",
  "Description": "Alright 👍",
  "Comments": [
    "Alright 👍",
    "You got all that on your lunch break?? Are you a dealer?",
    "The absolute insane value density of gold blows my mind. If you didn't know better you'd probably ballpark the value of the gold in this picture at about the same as the value of the silver in this pic. In reality, it's probably like 50x",
    "51oz of gold, 130oz of silver",
    "It's about 28x more. About $3500 in silver but nearly $100K in gold.",
    "Wow!! , nice stack. I have been collecting gold and silver for a long time and I promise “ your hard work and dedication will be rewarded”. It’s funny how it works. One day as PM increase in value u just do some math and say to yourself wow did I do that and the answer is YES",
    "I appreciate you sharing that. I am only one year in, but it’s nice to think one day I will have that moment you describe .",
    "Those maple leaves just glow! Stunning.",
    "Sweet!",
    "Also, screw you",
    "✅",
    "awesome bars",
    "Indeed.  Nice toning on those old Engelhard silver bars. 👍",
    "Cool... very cool",
    "Isn’t it great when the mail delivers?",
    "Dude f u"
  ]
}
{
  "Title": "Custom cut foam for my 1oz coins. Going to need a bigger case!",
  "Description": "Repost... I wanted to get the pictures of the work in progress on there! It is a Pelican 1170 case. In this configuration it will hold 84 coins. I could have made it fit a few more but I wanted the strength in the foam. None of the coins rattle around... all fit very securely!",
  "Comments": [
    "Repost... I wanted to get the pictures of the work in progress on there! It is a Pelican 1170 case. In this configuration it will hold 84 coins. I could have made it fit a few more but I wanted the strength in the foam. None of the coins rattle around... all fit very securely!",
    "84 oz... well over 100k",
    "😳",
    "Did you custom cut the foam?",
    "Yeah. Look through the other pictures 🙂",
    "Do you take customs orders?",
    "Sure, why not. I'm in the UK so as long as you can pay shipping then we can make something work. DM me.",
    "Gold Buffalos 😘",
    "I wish! Mainly Britannias but I’d love some more Buffalos!",
    "You don't have to count your silver.",
    "Just weigh it, subtracting the empty case weight.",
    "If this case was for silver then you’d likely need a bigger case! Peli make some huge cases and there is no limit to what you can do with foam if you want to go down that route",
    "Thank you for this , you just inspired me to start a pelican case stash ........ I sent you a pm",
    "If I had that setup I would keep them in air tights too.",
    "That looks amazing. Do you actually have 84 1 oz gold coins? If so good on you!",
    "Thank you 👍",
    "Or... you could get rid of the AirTites, put the coins in tubes, recut a foam insert... and double the amount of coins in the case.",
    "And put a flat slab of foam in the top instead of that convoluted stuff that only contacts the coins where the fingers are :)",
    "That was my setup before but I like the airtites! May go back to tubes for my ‘just bullion’ coins and keep my less common coins in airtites. Haven’t decided yet… but for now this is cool",
    "Sorry I'm new to this... but are they 1 oz troy ounces? Is 1 oz the same or?",
    "Slightly different… but usually when referring to gold, if you say 1oz you mean 1 troy oz.",
    "You are missing a Glock"
  ]
}
{
  "Title": "can anyone give a estimate for the value of my gold?Pinky Ring, 14K Real Diamond, Middle And Pointer Nuggets 10K, Cuban Link 10K, Regular Chain 14K with 14K Real Diamond Cross, Nd 10K Rope Chain With 14K Tweety Bird Pendant..",
  "Description": "Please weigh it",
  "Comments": [
    "Please weigh it",
    "Weight is probably the most important factor here",
    "Get a scale and weigh it . Cant tell by looking at it allot of jewelry is hollow",
    "That other chain is called a figaro fyi",
    "Just FYI, the diamond is going to be valued at next-to-nothing.  Diamonds' ",
    " value is all due to marketing and Hollywood (eg. payments in diamonds are B.S. plot devices).",
    "Cash4Gold etc always lowball on the first offer because people are desperate and/or don't know any better.  So it's great that you are trying to find out, just don't go with the first offer if you do try to sell any of that.",
    "I’d say you got about tree fiddy",
    "Not knowing a thing about the diamonds and estimating the weight you are somewhere in between 450$ to 600$ for the whole set",
    "The diamond might be worth something, but not very much. Diamond  (or any gemstone) accents add zero value when selling gold or valuing jewelry, although they will be resold.My uncle had a ring with one smaller diamond and some accent stones and I was told it would sell for the price of the gold by an appraiser."
  ]
}
{
  "Title": "5 gramms of Argor Heraeus gold bar, how do I check if it's real?",
  "Description": "Hi guys!",
  "Comments": [
    "Hi guys!",
    "I am looking into buying my first gold bar, I am located in the EU, and Argor Heraeus seems like a reputable source. (I am open to trying other brands, if you have suggestions.) I am however worried that I might buy some fake gold. Their website says their bars come with certificates, serial numbers, the works, but I cannot find any tools online that would allow me to check these serial numbers.",
    "So my question is:",
    "How do I check whether that the Argor Heraeus gold bar I'm planning on buying is real?",
    "If you're buying from the official site. There shouldn't be a problem. If there are no tools to double check you should be able to get in contact with them an verify it.",
    "Thank You!",
    "I'll try to get in contact with them.",
    "Who you buy it from is usually more important than the make of the bar. Everything that leaves a recognized bar manufacturer is 100% legit. Unfortunately everything that leaves the Chinese \"replicators\" is not."
  ]
}
{
  "Title": "Supercharge Your Study With the Phlinx Browser Extension - Quickly look up any word, person, place or entity mentioned on any page. Whatever you long click you’ll get a sidebar full of useful information!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Weird advice from Freud on investing in gold",
  "Description": "I want to buy a piece of gold but my friends say it's useless junk that only 'old white men' buy. They are telling me to buy Doge and follow wallstreetbets for the win. Aluminium used to be worth more than gold. Do all metals eventually fade into worthlessness?",
  "Comments": [
    "I want to buy a piece of gold but my friends say it's useless junk that only 'old white men' buy. They are telling me to buy Doge and follow wallstreetbets for the win. Aluminium used to be worth more than gold. Do all metals eventually fade into worthlessness?",
    "I found this article that says investing in gold is a psychological disorder that is the equivalent of saving your own faeces.",
    "\"Miserly people—those who hoard money, and in Freud’s day, gold—were the same types who hoarded their shit as children. As it happens, Freud traced his gold-shit analogy back to antiquity, arguing that the relationship between the two was inextricable.  \"",
    "I have seen more gold around black rappers necks than I have \"old white men\".",
    "But the fact you needed to write this says everything I need to know.  Cya.",
    "Guys, don’t respond to trolls.",
    "Gold is tangible, and used in actual products.... I have never used crypto to buy anything yet... and it has a short history and a power outage can keep me from accessing it. Crypto might heave a place in society... but I used to have a MySpace and a AOL account, along with MCI as my long distance carrier.",
    "And a diamond is just a rock.",
    "You seem to think that Freud equated gold to poop because gold has no intrinsic value, when that isn’t what Freud was saying at all.",
    "Freud was relating the idea of holding physical gold to one of ",
    " theories about childhood development. Huge emphasis on ",
    " theory.",
    "You could use the exact same argument for crypto, or even fiat money—that, to Freud, hoarding any of these is like a child hoarding poop. Same idea, it isn’t saying that gold is worthless.",
    "Why are China, Russia, etc  increasing their gold reserves?",
    "Maybe they know something that the media isn’t telling you 🤔",
    "I know, why would the media lie to you? 😜",
    "LMAO it's a hit piece on the Tea Party movement by the New Republic. Absolute trash. I'll bet you'll find two dozen similar articles from the past four years from the same author about Trump voters.",
    "When I was young gold was $350 to 800 an ounce. Now what is it? It’s just another way to save money with out the loss from inflation.",
    "Yet it’s the same price today as it was ten years ago, so no inflation loss? At least, gold’s a tangible asset that leaves you something if/when paper goes ‘poof’.",
    "Old white men, only??  Have your racists \"friends\" ever been to India, China, Africa, South America?",
    "That article was written by a communist/wannabe-be-slaver-slave trader. They absolutely hate things and people they cannot control. Stay away from PC perverts and get some good friends who'll give good advice...",
    "Gold tracks inversely to real interest rates.",
    "It does so because when the next safest investment, bonds (first paid in bankruptcy, etc.), don’t pay a return, it’s time to put your money somewhere as a “store of value”.",
    "Gold has a negative carry cost (~.5%) to cover security, but it is as truly risk free as an asset can get, especially when holding physical privately.",
    "IOW, when you can earn income on your capital, gold is the last resort.",
    "The inflation hedge is no different. Owning earning-assets grows capital, regardless of inflation.",
    "Completely right but remember, white old men run the world guess why, they are clever :-)",
    "The New Republic, responsible for some of the biggest farces ever printed.",
    "Reference; Stephen Glass."
  ]
}
{
  "Title": "silverstacking better than fiat currency",
  "Description": "Beautiful 🤩",
  "Comments": [
    "Beautiful 🤩",
    "Thank U",
    "What is that piece of gold, and where can I find one?",
    "1/10 oz australian 15 dollar/2012/year of the dragon"
  ]
}
{
  "Title": "Getting physical in Europe?",
  "Description": "What does this mean ?",
  "Comments": [
    "What does this mean ?",
    "Prices are going up.",
    "Not sure what is their motive for doing this. How does this benefit the banksters?",
    "\"The Bank for International Settlements (BIS) leases and swaps unallocated gold to bullion banks. This multiple ownership of gold and the volume of BIS derivates are calculated to be in the trillions of dollars. Hypothecated gold trading represents an impossible volume of precious metals trade. Any default of unbaked paper against actual metal poses the risk of a financial crisis worse than the ‘08 financial disaster.\" -Andrew Maguire",
    "I am gonna need a drawing",
    "EDIT: O nvm",
    "Hi gonna need a drawing, I'm Dad! :)",
    "Basel III is an internationally agreed set of measures developed by the Basel Committee on Banking Supervision in response to the financial crisis of 2007-09. The measures aim to strengthen the regulation, supervision and risk management of banks.",
    "Like all Basel Committee standards, Basel III standards are minimum requirements which apply to internationally active banks.  ",
    " marks the implementation date for the Net Stable Funding Ratio (NSFR) in Europe",
    "NSFR’s wider ",
    ", within the Capital Requirements Regulation (CRR) II framework, is to oblige banks to finance long-term assets with long-term money in order to ",
    " seen during the 2007/08 global financial crisis. For precious metals, NSFR will require 85% of Required Stable Funding (RSF) to be held against the financing and the clearing and settlement of precious metals transactions.",
    "From our analysis, the EBA would have a compelling case to classify gold as an extremely HQLA if the Amihud ratio was recalculated with LBMA-i trade reporting data.",
    "Since November 2018, ",
    " has been ",
    " using LBMA-i data, which covers gold, silver, palladium and platinum from LBMA members in Loco London and Loco Zurich. ",
    "* High-Quality Liquid Assets (HQLA)",
    "The ",
    " had ",
    " that LBMA’s 2019 analysis did not demonstrate how gold’s liquidity is affected in times of market stress. In these unprecedent times caused by the COVID-19 pandemic, gold has justified its status a safe haven, and therefore liquid, asset. In March, daily trade volumes reached almost $100bn – on the same day where almost £125 billion was wiped off the FTSE 100 and markets were hit by an oil price war.",
    "Should the 85% RSF requirement be introduced, we may see:",
    "A rise in the cost of the clearing and settlement service provided by LPMCL which may impact the service;",
    "A fall in market liquidity as banks look to exit the market;",
    "A rise in the cost of business across the supply chain. ",
    "The European Banking Authority  ",
    " plays a key role in the ",
    " of the ",
    "On the one hand, it provides expert technical advice to the EU institutions during the legislative process. On the other hand it is mandated to produce a number of ",
    ", Guidelines and Reports. ",
    " are legal acts which specify particular aspects of an EU legislative text (Directive or Regulation) and aim at ensuring consistent harmonisation in specific areas. BTS are always finally adopted by the European Commission by means of Regulations or Decisions. According to EU law, Regulations are ",
    " and directly applicable in all Member States. This means that, on the date of their entry into force, they become part of the national law of the Member States and their implementation into national law is not only unnecessary but also prohibited. ",
    "EDIT: Funny how ",
    " which is a  $6.8 trillion a year gold market ",
    " and now  ",
    " on 21 June 2021 exactly a week before the implementation date for the Net Stable Funding Ratio (NSFR) in Europe. I can't point my finger at it but something is up and it's not only Gold.",
    "Hey I liked your post in BEFire! Great job there.",
    "Basel III Threatens to Break The Gold Derivative Market in June – Gold Silver Pros  ",
    "Expect LBMA to fight tooth and nail to be exempt or delayed. Also expect high volatility if they don't get it.",
    "They're going to need extra time to fine that missing tonnage of silver",
    "The LBMA have already voiced their displeasure to this measure",
    "Might be a coincidence, but my smallish local online dealer put up a warning just yesterday that due to covid, ever rising demand and their own unwillingness to raise premiums on customers, they may experience extended lack of fresh inventory.",
    "They source most of their coins (napoleons, vrenelis...) in France and their sources are simply drying up.",
    "My guy told me to not hold my breath for Francs for the time being. There's definitely something going on.",
    "Well... sounds like he should raise premiums. It’s not being rude to the customer to follow supply and demand. It’s rude not to.",
    "That's interesting. Sounds like gold scrounging is starting to happen.  For those who have some coinage that is semi-rare, may be worth hanging on to.  A lot of the freely available stuff may get melted down into bars?",
    "I thought I read recently that due to the pandemic, Basel III was postponed until 2023.",
    "The LBMA got a 6-month delay until Jan 2022. But they will have to deal with European and Swiss dealers and refineries who must be compliant with Basel III, so they will feel the impact regardless.",
    "Not aware of any further delays till 2023 though.",
    "If the banks don't like it they will just change the rules and kick the can down the road some more.",
    "If ELI5 is: prices are going up. What is ELI 10?",
    "Raising and lowering the nominal value of money is shown not to undermine the theory of the value of money. In contrast, such measures are shown to be methods by which the King or Goverment acquires resources by deceiving individuals about the value of money. The process causes chaos in the market.",
    "I have literally no idea what this means... can someone ELI5? Does this mean that EU governments can settle debts in gold?"
  ]
}
{
  "Title": "PSA: Pays to flip through the junk mail - Get a 1oz. AGE + free 1oz. ASE for $1,700. Limit 1. Gold under spot with free silver - can’t go wrong.",
  "Description": "In case anyone is interested, the current price they're offering is $1930",
  "Comments": [
    "In case anyone is interested, the current price they're offering is $1930",
    "The $1700 price was at the time of printing, 3/30/21. Spot was roughly $1685.",
    "Spot today is almost $150 higher, so the deal I’m assuming will be priced accordingly. Either way, hey!",
    "Regardless it’s an AGE for spot with a free ASE…even if the price has creeped up to track with spot it’s still a steal.",
    "Most of these super mag ads are legit... you'll get the cheap gold coin. It is evidently cost effective for these companies to \"give away\" some premium to get an interested person's email/phone#... and you will definitely be hearing from them several times.",
    "PS: They buy these coins wholesale and in large volume to begin with. Plus I would expect this to be in their advertising budget... e.g.: written off.",
    "I did this and they’ve only called me once",
    "100%",
    "Littleton Coin has given me a lot of at or below spot silver with their intro offers you can do over and over.",
    "I bought ten 1/10 gold eagles in 2017 from nationwide. They do honor the deal. You just have to deal with an annoying 45 minute phone call where they try to bait and switch.",
    "How did the chocolate inside taste?",
    "Nice!",
    "Plan for 20-30 minutes of chit chat and attempted upselling to complete the purchase, but it’s legit.  Got one for $1,735 last month - ",
    "Legit. I did the ten 1/10 AGE years ago, and had my father buy an AGE recently (~$1800s). They don't charge shipping anymore, nor any CC surcharge. Great deal.",
    "1700 was the price on the day of printing, you have to contact them for todays price, according to the fine print. And for the ASE, I dunno... It's their way of buying a lead, I guess. There's no such thing as a free lunch.",
    "Not to say it isn't legit, but junk mail ads are all the way up there with TV Shop on the BS scale for me.",
    "I'd love to hear more if somebody gives this a go.",
    "Sure even if the price tracks with spot, getting an AGE for spot with a free ASE thrown in is still a heck of a deal these days. It certainly is them buying a lead - why not take advantage?",
    "I take advantage of all the various Littleton Coin intro promos too... I've gotten a lot of silver at and even below spot price. So long as you know what you're getting into these promos are a honeyhole for experienced collectors / stackers.",
    "I did some research on this a few weeks ago. From what I can tell, it is legit. They will just try to upsell you into some other overpriced stuff over the long run. So they probably make their real money in unsuspecting people who overpay for the other stuff they push.",
    "Let us know how it goes if you decide to go for it.",
    "Exactly, they want to rope you in with one actual good deal, then they push the overpriced stuff at which point you say no and ask them to leave you alone."
  ]
}
{
  "Title": "Help finding a item",
  "Description": "I was curious if anyone had suggestions on where this might be in stock. Prefer a USA based company.",
  "Comments": [
    "I was curious if anyone had suggestions on where this might be in stock. Prefer a USA based company.",
    "This looks the 2.5 gram version?",
    "I think these have been discontinued by PAMP. You may be able to find one on eBay but expect a high premium."
  ]
}
{
  "Title": "Buying gold for tax reasons?",
  "Description": "Since gold and precious metals isn't taxed when bought or sold, if I convert profit from a company into gold and then pay myself out, wouldn't I be able to pay no tax?",
  "Comments": [
    "Since gold and precious metals isn't taxed when bought or sold, if I convert profit from a company into gold and then pay myself out, wouldn't I be able to pay no tax?",
    "Get an accountant, not Reddit accounting advice",
    "This may help ",
    "No. My god no. First... the gains on gold ARE taxable events. Whether you pay sales tax is up to what state you live in.",
    "But the IRS is going to tax your profits and the tax is only payable in US dollars.",
    "Also the IRS doesn't care if you get paid in gold, cash or an agriculture truck full of cattle. They tax the value in USD.",
    "Oof",
    "You might owe capital gains tax when you sell. Make sure you understand the laws.",
    "What country are you in?",
    "US",
    "Depending on where you live, PMs can have a tax. Best to ask a tax professional first before doing anything. Also in my experience you can never escape the tax man. They’ll always find a way to get theirs.",
    "If your company pays it to you it would still be subjected to personal income tax. Consult a CPA to be certain, but cheating the IRS may prove to be more expensive than paying your taxes.",
    "...but cheating the IRS may prove to be more expensive than paying your taxes.",
    "Especially if you value your time + freedom.",
    "I know gold Britannia coins ( Britain) are exempt from capital gains, so I can sell these for a profit without risk of tax, but if you make profit from a company, I don't think you can transfer that wealth into gold for tax reasons. You're going to be taxed from your company. The only way I think you get away with tax is if you use the profit to put towards your company. For example a youtuber could put profits into buying a really expensive camera, an expensive computer etc that could be used towards tax. You need to speak to an accountant.",
    "I am a tax accountant if you want to PM me. It’s a good thought, but odds are you will end up paying tax on the gain/income from and business activity. There are always ways to minimize this depending on the business entity/function. Generally tax avoidance with precious metals is done by simply not reporting the gains, but unfortunately this is not legal. (My knowledge only applies to US as I am a bit rusty on IFRS)",
    "pay yourself face value 20 dollar gold coins etc.."
  ]
}
{
  "Title": "Van Cleef & Arpels Vintage Alhambra 18K Yellow Gold 5 Motifs Bracelet",
  "Description": null,
  "Comments": []
}
{
  "Title": "The most beautiful yellow thing I’ve ever held",
  "Description": "At what price did you get that coin?",
  "Comments": [
    "At what price did you get that coin?",
    "About 2210 is what spot on these are since they are a little over 1 ounce",
    "My all-time favorite, they’re just plain huge!"
  ]
}
{
  "Title": "Looking for 1/4 oz 2017 to complete my collection. Can’t find anywhere. Any ideas? $600 max",
  "Description": null,
  "Comments": []
}
{
  "Title": "My first gold purchase! I already want more",
  "Description": null,
  "Comments": []
}
{
  "Title": "Queen's Beasts collection coin",
  "Description": "Awesome looking coin! Enjoy it!",
  "Comments": [
    "Awesome looking coin! Enjoy it!",
    "Looking forward to receiving mine next week 🙂",
    "You're going to love it!",
    "What a beautiful coin!"
  ]
}
{
  "Title": "Mail call 10th oz proof from apmex. I normally just buy locally because I dont like waiting for what I pay for but I've been wanting one of these. I switched the capsul I'm a fan of the black ring capsules.",
  "Description": "I like black ring airtites; they hold coins much more securely IMHO.  Especially for fractional gold & platinum.",
  "Comments": [
    "I like black ring airtites; they hold coins much more securely IMHO.  Especially for fractional gold & platinum."
  ]
}
{
  "Title": "TIL there is gold in our brains and throughout our nervous systems, and without it, human beings might not exist. The gold in the human body, less than the weight of a single eyelash, is critical for rapid electrical signaling and brain function.",
  "Description": "An eyelash is 0.40 micrograms which is 0.000001286 oz t. Worth roughly $0.002. The entire human population of 7.8 billion is worth around 15.6 million, so get mining.",
  "Comments": [
    "An eyelash is 0.40 micrograms which is 0.000001286 oz t. Worth roughly $0.002. The entire human population of 7.8 billion is worth around 15.6 million, so get mining.",
    "wow, nice math! The problem is, the gold atoms are scattered all over the human body - it's easier and more ethical to mine gold panning from streams.",
    "What if I only mine the fatties?",
    "This is what bitcoin is, or atleast my understanding of it",
    "The Anunnaki must never learn this.",
    "You forgot teeth",
    "...",
    "Lmao",
    "Is this the father from dead poets society?",
    "I'm lazy and not that greedy. I'd rather organ harvest a few 100 people.",
    "Now figure out how much platinum we can mine from road dust and exhaust fumes from catalytic converters...please?",
    "Everyone was wrong afterall, im not worthless!",
    "Gonna go swallow a nugget.",
    "Lot's to find in the cave above",
    "Be careful, not all nuggets are gold.",
    "So how does the body create gold and can we replicate that process?"
  ]
}
{
  "Title": "Deviating further into old gold...my first Mexican pesos! 20 francs for scale",
  "Description": "They look tiny. How much does each one weigh?",
  "Comments": [
    "They look tiny. How much does each one weigh?",
    ".0603oz of gold, at 0.9 fine. So it bit over 1/20th. They are really tiny! The dos peso is even smaller at .0482oz gold.",
    "Oh man gold peso’s my favorite!",
    "Love those 2.5’s . I bought one last week"
  ]
}
{
  "Title": "10 gram bar from the Perth Mint",
  "Description": "Ah yes. That was my first gold",
  "Comments": [
    "Ah yes. That was my first gold",
    "Qantas called and wants its gold back....",
    "My first one as well came yesterday!",
    "secondary market from apmex"
  ]
}
{
  "Title": "Any Bucs or Broncs fans in here?",
  "Description": "Fire the cannons!",
  "Comments": [
    "Fire the cannons!"
  ]
}
{
  "Title": "My first ounce! So excited I'm shaking!",
  "Description": "Bite it as hard as you can, make sure it’s real! Old-timers used to do this in my coloring books and it worked every time!",
  "Comments": [
    "Bite it as hard as you can, make sure it’s real! Old-timers used to do this in my coloring books and it worked every time!",
    "It’s only 90% so you might break some teeth.",
    "Put that bad boy in a capsule!",
    "• kewl •",
    "TY!   Shopping for 10oz silver bars currently.",
    "Don’t drop that shit!",
    "Au-some. May you be able to collect more. Nice  start.",
    "Hahah I love that.   Au.    TY!",
    "Congratulations! It's a great feeling.",
    "Welcome to the club",
    "It's a really great feeling right!",
    "Welcome brother,",
    "from now and on you know what \"My precious treasure\" really is like.",
    "That is a beautiful coin. Congratulations on your first ounce! May it be the first of many! Happy stacking!",
    "Thank you!   I was so hesitant to make the purchase.   I have always invested in physical items (guns, ammo, etc).   Something I could sell without much loss if I ever needed cash.",
    "Gold was an obvious choice.   But.... Still hesitant.",
    "It's always good to have some Depends available before you actually buy your first gold.",
    "Put it in a safe!!!!....... in a volt..... in a volcano",
    "Chevrolet makes the best cars for storing gold",
    "Nice coin, get some capsule for that and let it age in protection",
    "It's in a plastic sleeve.   I was going to order a capsule for it",
    "It's so beautiful",
    "Nice!!"
  ]
}
{
  "Title": "Anyone have experienced/ advice about Gold Pandas? Im thinking about picking one up but not sure what a fair value since they are 30 Grams instead of 1 Troy OZ.",
  "Description": "Any advice / encouragement is appreciated!",
  "Comments": [
    "Any advice / encouragement is appreciated!",
    "Premium is kinda high for not even 1 oz coin.",
    "I actually did the math and 30 grans is actually  1.06 ounces so it is over an ounce",
    "Just FYI, 2016 they went to metric units. 2015 and earlier are Troy ounce and fractions there of.",
    "I have been told that the purity is not consistent. This was from a coin dealer. I’ve never read or heard it elsewhere. They are supposed to be known for exceptional purity.",
    "I head that too like 10 years ago;  that was the opinion when they first came out i believe.   When did you hear this from your LCS?"
  ]
}
{
  "Title": "You ask, I answer - 999 Au Beskar - 1.85 ozt",
  "Description": "How much is the premium for these?",
  "Comments": [
    "How much is the premium for these?",
    "It’s a bit more variable than silver. With all metals I’m paying over spot for my supply, then I have to charge for my process as well. So it really depends on the sourcing available.",
    "Edit: pricing is likely to be $2025 per ozt for right now. The reason I’m hesitant to post pricing typically is due to spot and premium changes (I know everyone knows it changes but in 6 months one won’t necessarily remember or think about what spot/premiums were today when I posted lol)",
    "All of these will come in capsules packaged as seen. These will also be serialized. BAU001 is sold. (Beskar Au = BAU)",
    "Up front pricing will be based on 1.75 ozt and a final payment due upon completion based on the final weight. This bar came to 1.85 ozt but I suspect the upper limit of the mold could be as heavy as 2 ozt (there is slight weight variability when pouring in delft clay)",
    "Can you PM me the price",
    "Stunning work though dude, really great finish.",
    "Thanks so much",
    "Really nice work",
    "Thank you very much 🙏",
    "Now that’s what I call fine.",
    "🙏🙏",
    "I need this",
    "I’m here for you when you’re ready",
    "This is the way!",
    "This is the way",
    "Hot damn, that is pretty!",
    "🙏 scary to pour but I made it",
    "What's the conversion rate on this to ",
    "?",
    "A whole bunch? 😂",
    "Pass. Hard to test due to bumpy surface. Ultrasonic thickness gauge won't work well either. Not a well-known mint."
  ]
}
{
  "Title": "Some newer pickups",
  "Description": "the buffalo and ducat are for my son who turns 2 soon",
  "Comments": [
    "the buffalo and ducat are for my son who turns 2 soon",
    "I bought some ducats to sell if spot rises, but I fell in love accidentally 😭",
    "How do you like the newer Krugers? I have only touched ones from late 70/early 80s"
  ]
}
{
  "Title": "My First Piece!! 🚀🚀🚀",
  "Description": "White gold?",
  "Comments": [
    "White gold?",
    "Sorry just very bright room when took photo. :)",
    "Why is your gold silver/white color? Or is it the camera or something",
    "awesome.",
    "now buy another.",
    "Definitely!! Just ordered my capsules yesterday. They should be here today!!",
    "Nice way to start a stack. Congratulations.",
    "Thank you!!",
    "Is the 1/4 Oz equal to a quarter or a dime in size??",
    "Close to dime/nickel size. But you can immediately feel the weight."
  ]
}
{
  "Title": "Organizing for a few pieces coming in this week!!",
  "Description": "Congratulations and fuck you",
  "Comments": [
    "Congratulations and fuck you",
    "Lol",
    "Excuse me while I go throw my pitiful excuse for a stack into the river",
    "You have a stack? I don't even have a coin yet.",
    "*waits at the river with a snorkel*",
    "Baller...",
    "O... M... Goodness",
    "Man, I need to start checking the coinstar machines more.",
    "Exactly... me too 👍",
    "Oh My!!!!",
    "What, no Goldbacks ???",
    "Lol, sweet stack 😉",
    "This is definitely something to strive for. Congratulations",
    "Wow! Beautiful collection you have.",
    "Lort have mercy",
    "Cool cleaver",
    "Gold cleaver. You are the man.",
    "OP just found the King Solomon's hoard!",
    "I want that gold butchers knife",
    "Slide that one over and move this one by that one. Ok I should room for my new 💩. Show off. 🤪🚀",
    "I just ordered my first piece!! It should be arriving soon also. I have plenty of room for it. Lol",
    "Quick guesstimate:  about 50 ounces in coins and about the same in bars?",
    "The more gold, the more downvotes. Why?",
    "Straight flexing",
    "Wow I wish I have as many gold as you :)",
    "You must be rich as fuck lol.",
    "Good stacking!"
  ]
}
{
  "Title": "Just found this at my local coinstar, any idea what it’s worth?",
  "Description": "Best i can do is 300$",
  "Comments": [
    "Best i can do is 300$",
    "Tree fiddy",
    "I need to frame and a clean it up that costs money",
    "“nono chum, you maaaahran, offer him five bucks!”",
    "About .50 cents.",
    "Is there dark chocolate or milk chocolate under the foil",
    "Half a cent? Damn dude, even the chocolate industry is rough",
    "Probably 45-50$ I’ll give you 60 for it cash",
    "Sounds good. But don't call me cash.",
    "Does anyone even read previous posts anymore?... #4 or 5 LOL",
    "468,000.00 usd",
    "Serious coin collectors only want dirty coins with a slight tone to them. So unless you lightly scratch this up, drop it onto the dirt, run a metal detector over it, nobody is going to want it.",
    "Source: I’ve been on Reddit long enough to know what people want, and it’s disgusting!",
    "Redditors only care about one thing and it’s disgusting",
    "Lol gold doesn’t tone, unlike silver, not 24k gold. 😂 Coin capsules take care of all worries though. 👍",
    "Uh, coins are not secure compared to bars, it's worthless /s",
    "More than my car, less than my wife's boyfriends car",
    "Ooooo, damn...",
    "Brits always showing off...",
    "It's Britney bitch",
    "About tree fiddy",
    "Hahahaha 😂",
    "My question is, is this gold? Purity? Saw it on other subreddits and my questions are unanswered.",
    "It’s 10 kilos of gold and a mintage of only 1 coin. Price is unlisted and there is an application process to be considered for purchasing it."
  ]
}
{
  "Title": "Buying",
  "Description": "Where does everyone get their coins from. I’m from Australia and want to start collecting sovereigns I have one but want more any coin conventions in Aus or websites ?",
  "Comments": [
    "Where does everyone get their coins from. I’m from Australia and want to start collecting sovereigns I have one but want more any coin conventions in Aus or websites ?",
    "In Australia, you goto an electronics store, and buy a metal detector. Giant gold nuggets right at the surface!!!! Im surprised people arent using planes, and cameras, marking the location of any glint.",
    "Cunt what"
  ]
}
{
  "Title": "Philharmonics?",
  "Description": "I have been looking at Eagles and Maples but the premiums and availability are absurd.  Philharmonics appear to be a good third option, any thoughts or warnings?",
  "Comments": [
    "I have been looking at Eagles and Maples but the premiums and availability are absurd.  Philharmonics appear to be a good third option, any thoughts or warnings?",
    "Bars would be cheaper but also are much easier to counterfeit, and I don't like the idea of spending money on things that are trapped in assay cards and can't be easily tested if at all.",
    "Not as recognized as eagles or maples but Philharmonics are a good option.",
    "Yes, the recognition issue is what is holding me back.  I like the Pamp Lady Fortuna bars in terms of appearance but I've seen far too many stories about counterfeit 5 gram and 10 gram bars to want to go there.",
    "Not as did recognize as eagles 'r maples but philharmonics art a valorous option",
    "Commands: ",
    ", ",
    ", ",
    "They are really one of my least favorite designs coming out of a national mint, but I still bought one as my first fractional because I couldn’t beat the premium.",
    "get a krugerrand",
    "I say buy one or two but don't make em the base of your stack. They are less popular than other designs, but great for helping get the dollar per ounce down without being a bar. You never know what might be more popular in the future."
  ]
}
{
  "Title": "1/4 oz Krug",
  "Description": "The 1/4 oz krug is the perfect coin",
  "Comments": [
    "The 1/4 oz krug is the perfect coin",
    "I absolutely love silver krugs. I didn’t even know they made gold ones in this denomination until I saw this today - can’t wait to get the half and full oz coins next",
    "The one ounce is not bad either",
    "Love this. My next coin is definitely going to be a 1/4 oz. Great size. And who could not love that springbok?"
  ]
}
{
  "Title": "Gold increases as rising COVID-19 cases facilitating US dollar support advance",
  "Description": null,
  "Comments": []
}
{
  "Title": "My first 1oz Eagle!",
  "Description": "Congrats! My largest piece is 1/4 Oz but hopefully by years end I’ll own one of those. 😁",
  "Comments": [
    "Congrats! My largest piece is 1/4 Oz but hopefully by years end I’ll own one of those. 😁",
    "Thank you and good luck, hope you get one. :)",
    "Nice!",
    "I only own a 2.5g and a 5g bars",
    "Nice! 🔥",
    "Beautiful! I don’t understand why they don’t call this one a “double eagle” since this coin ",
    " two eagles on it compared to the gold coin that is actually called a “double eagle”....🤔🧐🤨",
    "its got 4 eagles",
    "Enjoy the one, good sir. Plenty more of that where that came from!",
    "It is beautiful!",
    "thanks. :)",
    "Good on you brother! Stack of 1,000 Ounces starts with 1 ounce.",
    "My favorite to make a ring from!",
    "How much $$$?",
    "$1900 and some change"
  ]
}
{
  "Title": "All started with the 1/10 eagle 🦅",
  "Description": "Nice cock.",
  "Comments": [
    "Nice cock.",
    "i have to admit the premiums really suck on the small gold pieces (but then they suck on silver these days too), and anything that gets one started in owning real metal is a good thing...",
    "Totally agree.",
    "Gold Squeeze",
    "I went the other way starting with a $20 st. Gaudens but end results are the same, a pocket full of gold stuff! Nice collection bud",
    "Bravo.  Someday this will payoff 5 fold"
  ]
}
{
  "Title": "Gold, Stuck Between Its Current Situation and Future Prospects",
  "Description": "As 10y-30y yields come off from recent highs, the underlying inflation in the economy and depreciation in the US dollar will see Gold rise. Fingers crossed 🤞 Silver catches a bid too.",
  "Comments": [
    "As 10y-30y yields come off from recent highs, the underlying inflation in the economy and depreciation in the US dollar will see Gold rise. Fingers crossed 🤞 Silver catches a bid too."
  ]
}
{
  "Title": "Gold Over Bitcoin? 3 Bullish Gold Stocks Going Into The Week",
  "Description": "Gold every time!",
  "Comments": [
    "Gold every time!",
    "There are so many gold mining stocks.  If you have the time, and the analysis abilities, I recommend poring through the different mining companies. My current pick, WINSTON GOLD, their high grade Montana gold mine veins have just started producing Gold slag for shipping and processing.",
    "I've invested heavily in both. Bitcoin since 2012 and gold since the 90's. Both have done very well. Bitcoin though is on a different level. It's a technology, so if I had a choice it'll be bitcoin. Actually that was my choice, because in 2012 I took the right decision to slow down my purchases in gold for bitcoin."
  ]
}
{
  "Title": "My new pet.",
  "Description": "Solid gold or plated?  Very bullish",
  "Comments": [
    "Solid gold or plated?  Very bullish",
    "Thanks. Found it on Amazon I think is just paint."
  ]
}
{
  "Title": "What do you think about these nuggets and flakes?",
  "Description": "Was wondering when some el-natural gold would get posted.",
  "Comments": [
    "Was wondering when some el-natural gold would get posted.",
    "Au naturale",
    "Further Information:",
    "The Flakes are 2.08g and the nugget is 0.6g. Coming from Manley Hot Springs Yukon.",
    "I think they're amazing.",
    "Love nuggies! These look more lode than placer.",
    "Looks like gold.  It is beautiful.",
    "Those look chunky!",
    "What’s the process for selling these? Same as any other bar?",
    "You can see a lot for sale on eBay (can recommend: ",
    "  . They can also be sold to online Nugget sellers (check Google).",
    "Natural gold nuggets are never 999 fineness.. usually anywhere from 18K to 22K. The larger the nugget the higher the premium. Small flakes (flour gold, gold dust) usually aren't worth buying unless you intend to refine it. Prices vary all over the place based on sieve size and gram weight. When I was buying I normally expected to pay full spot price (24K) per weight (regardless of actual unknown fineness)for up to 1.5-2 gram nuggets.. and more for larger ones.",
    "I think I’m gonna waste my time and comment for some upvotes that I get excited for only when I immediately see them. The excitement escapes and I’m left scrolling again...",
    "I think I need to find some",
    "That gold got cleaned dinnit?"
  ]
}
{
  "Title": "What do we think of the new 'frosted' design?",
  "Description": "They only did it to reduce their costs of mold maintenance. Mold imperfections are visible with mirror finish but hide in the rougher finish.",
  "Comments": [
    "They only did it to reduce their costs of mold maintenance. Mold imperfections are visible with mirror finish but hide in the rougher finish.",
    "Hmm good idea.. I like it actually but not per se over the mirror finish.. it's both nice..",
    "Agreed",
    "Well I just spent 10 minutes researching how gold could possibly grow mold on it,  and why it would be more prominent in a mirror finish.   Thanks for bringing out the inner tard in me that I've been attempting to suppress for years.",
    "SMART",
    "<3",
    "Personally don't like it ",
    " much as a mirror finish (it looks too modern or anodized for my taste), but the more I look at people's stacks here, the more I appreciate some variety in a collection.",
    "And as another commenter already pointed out, it's probably easier in terms of fingerprints. Enjoy!",
    "Fluff?",
    ":)",
    "I like Gold",
    "All my others are mirror finished",
    "Like it",
    "I like it",
    "As long as it’s .999 I like it 👍🏼🔥👍🏼🔥",
    "I love it. The sort of \"frosted\" texture and appearance looks great on metals. Polished mirror is great, but shows every single flaw and spec of dust. Frosted catches the light beautifully, it's like a million little reflective dots. I'd bust this baby out of its case so quick.",
    "I prefer frosted/burnished. I hate fingerprints etc.",
    "Asahi does the same finish on their silver rounds And it looks great",
    "This we likes it. Strangely enough the Chinese counterfeiters have difficulties matching burnished/frosted textures... often easily visible when comparing with an authentic specimen.",
    "Well I always wonder where people buy those fake bullion.. I mean I always buy at the same trusted shop when spending this cash right?! :)"
  ]
}
{
  "Title": "Gold swan is beautiful",
  "Description": null,
  "Comments": []
}
{
  "Title": "This is genuinely fascinating.",
  "Description": null,
  "Comments": []
}
{
  "Title": "What do I do with this?",
  "Description": "Pour it in a LEGO pirate chest and let them be happy.",
  "Comments": [
    "Pour it in a LEGO pirate chest and let them be happy.",
    "Sniff it.",
    "We are gonna check the weight tomorrow with some high school students for an experiment and determine if its worth testing further",
    "boof it",
    "It’s not gold sadly I use to have a ton of those",
    "What is it?",
    "Keep it 🤷‍♂️",
    "Very low fineness and super thin gold foil flakes.. pretty much worthless other than a novelty. Similar to the FDA approved \"gold foil\" that is used to decorate cakes etc.",
    "That seems likely since I only paid $60 for the bag of coins, but its a curious item to include. Why would they do that?",
    "Melt it brother to a coin! I dont understanding why some people say here that its not gold?",
    "This came in an ebay order with a bag of random old coins. No idea what it really is, how to assess it or anything. Any guidance would be greatly appreciated",
    "Take one or two flakes and see if it dissolves in acid, gold dissolves only in aqua regia as far as I know.  If it turns green in hydrochloric acid or dissolves you know enough."
  ]
}
{
  "Title": "Curious about your experiences buying gold through ebay and reddit forums",
  "Description": "Always looking for the best places to buy gold at reasonable prices. It seems that some sites like SD bullion and JM bullion are reliable and have decent inventory but charge hefty premiums. My local coin shop has extremely low inventory and high premiums. I’ve used reddit forums before, and seems like you gotta be really quick to capitalize on good even average deals.",
  "Comments": [
    "Always looking for the best places to buy gold at reasonable prices. It seems that some sites like SD bullion and JM bullion are reliable and have decent inventory but charge hefty premiums. My local coin shop has extremely low inventory and high premiums. I’ve used reddit forums before, and seems like you gotta be really quick to capitalize on good even average deals.",
    "I’ve had great success on Reddit both buying and selling. TBH the best deals are gone if you’re 10 min late to the posting but good deals on Reddit still beat retail from online dealers.",
    "Thanks! Yeah seriously, been looking for deals on 20 francs and those things are sold within minutes lol",
    "I've bought from a few private eBay sellers over the years. Three or four of them I bought gold from, several silver. I have a Sigma PMV and have never had any bad stuff off eBay (except one incident where the guy was removed from eBay then I idiotically contacted him outside eBay, but in the end my credit card companies backed me). Two of them I bought a couple of oz of gold on eBay, then contacted them directly to cut out the middleman fees and ended up buying another 8 or so oz from each, at well below spot (in both cases they shipped then I paid via check/F&F once I verified things). Once you establish a relationship you build trust and they know you're a reliable buyer.",
    "I've never bought from Reddit forums, partly due to the trust issue. I've bought from a few people advertising on Craigslist (and skipped many more who were shady). Met in a bank each time, tested everything. One person bought from several times. All repeat people were enjoyable to do business with.",
    "Thanks for the feedback! I’m definitely going to give ebay a try with some caution and diligence. I haven’t used ebay since like 2013-2014 lol but looks like there is decent inventory and some reputable sellers. Do you find good deals on ebay? Buying gold or silver closer to spot? Just sick of paying these higher premiums when I know if I went to sell same gold at a LCS they would buy back around spot.",
    "Reddit forums have worked well for me, but I have a value limit (amount of money I will risk losing) when buying. I wouldn’t do more than an ounce of gold per say.",
    "I prefer jmb and sdb.",
    "I know I'll get what I ordered and I'll never have the hassle of returning fakes, ect... What's your time worth? 🤔🦍🦍🦍",
    "Yes good point. More counter party risk there, may never get your order and not a lot repercussion. I’m a little weary of ebay because of that",
    "Big fan of both. More so JMBillion. Monument can be good. APMEX tracker is cool actually.",
    "Buying from trusted sellers on ",
    " and ",
    " can save you some on premiums usually as most sellers are priced competitive to begin with and then are often willing to negotiate somewhat. I rarely buy from large online dealers at this point because of Reddit and my LCS.",
    "Thanks for the comment. Do you have like a price point where you would rather buy from a large online dealer? Say if you’re buying over an ounce of gold etc?",
    "Or just depends on what you’re looking for?"
  ]
}
{
  "Title": "A rooster in the sunlight. My current pocket piece.",
  "Description": "A gold coin pocket piece... in a plastic capsule... to protect it from being a pocket piece. Makes perfect sense.",
  "Comments": [
    "A gold coin pocket piece... in a plastic capsule... to protect it from being a pocket piece. Makes perfect sense.",
    "No sense in devaluing it needlessly.",
    "I'm a heathen.",
    "I barely have the strength to carry silver in my pocket for more than a day let alone anything gold lol",
    "I’m very jealous I’ve been looking to get a bunch of gold from 1914 for a WWI mini collection",
    "I like it.  Congrats."
  ]
}
{
  "Title": "First sovereign many more to come",
  "Description": "I have the exact one as my first! Congrats! Look up a YouTube video of his voice that actually matches his face lol.",
  "Comments": [
    "I have the exact one as my first! Congrats! Look up a YouTube video of his voice that actually matches his face lol.",
    "Just got mine as well. Are they supposed to be copper colored? I know they are alloyed but mine looks weird it’s a newer one",
    "The newest ones have a rose gold colored tint to them."
  ]
}
{
  "Title": "\"We're gonna need a bigger safe\".",
  "Description": "Silver stackers",
  "Comments": [
    "Silver stackers",
    "???",
    "lmao"
  ]
}
{
  "Title": "Fake? Ebay purchase",
  "Description": "What makes you think it’s fake?",
  "Comments": [
    "What makes you think it’s fake?",
    "The serial number on mine is also engraved.",
    "Does yours have lines inside the horn?",
    "Was the seller a reputable company? You shouldn't be buying gold from random sellers on Ebay.",
    "The reason I ask is there are no lines inside the horn, the serial number is engraved not punched and the bottom  of the M on the assay card is a pointy not flayed",
    "Is it below spot?  If so it is fake",
    "No. I paid $170",
    "The bar radii are much sharper than normal - a usual tell.  Lady Fortuna details are too close to the rim, as are \"F\" and \"G\" in FINE GOLD, \"heavy\" fonts, assay stamp location.",
    "Looks fake sorry",
    "Does anyone know how much it should weigh with the assay card. Id rather not remove it if possible",
    "Try to look look at how thick the bar is vs others if you have another sample. That’s the easiest way to tell.  Remember real gold is very dense so achieving the same thicknesses proportional to others is near impossible. (Mainly brass is what these use in the fakes).",
    "It's my first purchase of gold so nothing in hand to compare it to but looking online the thickness looks correct not \"fat\" like the fakes.",
    "Lots of counterfeits of assayed bars.",
    "As someone who recently received 2 from apmex not in assay here are my photos. Your looks very proof like and shiny compared to my matte finish. You can see the F on back is right on the side though.. ",
    " ",
    "But I notice 2 other styles on Apmex. Yours seems like the serial style white back before the veriscan version back.",
    "Do you have a local shop with a sigma metalytics reader?",
    "So I contacted the seller and he is willing to replace it or refund so that is good. I'm new to gold so not exactly sure what to look for. Thanks everyone for the help!"
  ]
}
{
  "Title": "First ever gold bar",
  "Description": "Decided to jump in on gold becuase it seems so cool and ive liked seeing everyones coins, i bought a 2.5 grams gold bar today and i cant wait for it to arrive so i can just stare at it 🤣",
  "Comments": [
    "Decided to jump in on gold becuase it seems so cool and ive liked seeing everyones coins, i bought a 2.5 grams gold bar today and i cant wait for it to arrive so i can just stare at it 🤣",
    "Dont be discouraged when you get it and see how absolutely tiny a 2.5g bar is. Instead, try to appreciate how something so small can represent such large value.",
    "This describes my exact feeling when I ordered my first 1/10 coin as my very first PM collection. I was so upset I didn’t buy anything for a few months. Now I’m almost to an ounce. It’s a marathon",
    "A 2.5 was the first gold I've ever bought too. When it got there i was like wtf that's it!?!??? Lol it seemed really tiny to me. Been adding and adding and I still love that 2 5 g bar and ever other piece of gold. I stare at them quite a bit. Tiny gold is actually my fav now.",
    "Nice buy, gotta have some gold to lean on.",
    "That was my first purchase too! I get a magnifying glass out to look at them in detail now.",
    "Thats a great idea 🤯",
    "Gold is like cocaine. It's addictive, a little goes a long way, it can get expensive, and you often try to keep it a secret.",
    "Hahahah how true is that"
  ]
}
{
  "Title": "Said I was gonna buy a 100g pamp suisse bars...comments in last post and a few grand later...bought 3 1oz AGEs and my first Pre-33 piece..",
  "Description": "whats it like being a baller?",
  "Comments": [
    "whats it like being a baller?",
    "I’m only 21, my current goal is to save most of my gold for emergency situations/retirement. Most likely will give these coins to my future children and grand children. Aiming to fill 1/10th tube, then 1/4, then 1/2 and finally 1 oz :) Dream goal is to own a monster box of each denomination so I can feel like a damn Lucky Charm leprechaun 😭",
    "Startin to feel like JP Morgan in the 1890s😂",
    "It doesn't matter how much Bitcoin is worth, it will never replace the beauty of gold.",
    "very nice",
    "🔥🔥",
    "It's nice when you live at home.",
    "More people should. I hate that my expenses are $2500 a month. Thats 16 oz of gold i'm throwing away a year. I hope the guy is helping his parents out a little too.",
    "So nice! This how real money looks like!",
    "Beautiful.. and right choice...",
    "What did you get the 1901 for?",
    "$585, was my first piece so have no idea if that was a good deal or not. Either way, to me gold is gold😂",
    "Hardly a worry touching gold vs silver \"tarnish wise\" I don't think he's worried about coin ratings vs just owning gold. I say touch away friend! 👍🏻🤙🏼🇺🇲",
    "Tell me you know nothing about gold with out telling me you know nothing about gold..."
  ]
}
{
  "Title": "Magie des Goldes Serie - Münze Österreich.",
  "Description": "Just got myself two of these. 1/2oz proof. But close to spot",
  "Comments": [
    "Just got myself two of these. 1/2oz proof. But close to spot",
    "Wow. Those are gorgeous!! From where did you procure?",
    "Directly at the mint of austria online shop."
  ]
}
{
  "Title": "First Sovereign!",
  "Description": "My favorite Gold. Fractional, Historical and usually available at some of the lowest premiums around.",
  "Comments": [
    "My favorite Gold. Fractional, Historical and usually available at some of the lowest premiums around.",
    "I have 49, and want ",
    "RIGHT??? 😂😂",
    "Wont be your last... good work!",
    "Nice, congratulations!",
    "Hell yea! Just bought my first one today as well!",
    "I'm am curious how much one of these would run me approximately. I absolutely love this!",
    "$475 for mine!",
    "Just perfect!"
  ]
}
{
  "Title": "Free MoneyShow Metals virtual seminar",
  "Description": "April 20 to 22.  Some speakers on Gold and it is FREE!  Here is the link:",
  "Comments": [
    "April 20 to 22.  Some speakers on Gold and it is FREE!  Here is the link:"
  ]
}
{
  "Title": "Can I cross pollinate?",
  "Description": "I am a subscriber of the 2is1 Youtube:)",
  "Comments": [
    "I am a subscriber of the 2is1 Youtube:)",
    "Fantastic! ✋",
    "Man after my own heart. My two favorite collectibles, gold and pocket knives.",
    "I’m hooked on both!",
    "Aww. I love your videos. My YouTube has you on autoplay",
    "Hey, that’s great. Thanks!!",
    "I also love your videos! Thanks for joining us here. Love that picture, great composure. I always feel a precious metal photo is incomplete without some sort of multipurpose tool, like a knife.",
    "Thanks!",
    "Cool blade! What brand?",
    "It’s a Holt Haptic. ✊",
    "Enjoy your videos!  I want one of these knives!",
    "I’m spoiled on these things - I don’t really need or deserve any of them, but this Haptic is incredible!",
    "Thanks!",
    "I can get behind this!",
    "I didn't knew we were so many with the same two passions! Nice pic btw!",
    "Thanks!",
    "Absolutely love your youtube channel!",
    "Hay, thanks!",
    "Our river pollinates itself with gold each spring 👀",
    "Mine just brings in sludge."
  ]
}
{
  "Title": "The real price of gold is at $2,100, here's why – former U.S. Mint director",
  "Description": "Even though gold's spot prices are still trading below $1,750 an ounce, the real price of gold is a few hundred dollars higher, according to Ed Moy, former U.S. Mint director and currently chief market strategist at Valaurum.",
  "Comments": [
    "Even though gold's spot prices are still trading below $1,750 an ounce, the real price of gold is a few hundred dollars higher, according to Ed Moy, former U.S. Mint director and currently chief market strategist at Valaurum.",
    "The true price of gold is what people are willing to pay for the physical metal, including the extraordinary premium investors are currently faced with, Moy told Kitco News when speaking about the unprecedented demand for bullion coins so far this year.",
    "I’m not sure about his number, but I agree we should be including premium that we pay for the Gold in our real price.",
    "It annoys me when people brag about 24.5 dollar silver when they are paying 32 dollars an oz for example",
    "No such thing as \"real\" price of gold. There's just the regular price and that's it.",
    "There is always worth and value to anything that can be bought or sold, and they are two entirely different prices.",
    "If you were dying in the desert without water or freezing without a coat you would trade a $1000 gold coin in a second for what you need because at that moment gold has no worth.",
    "BS",
    "you can say the paper gold price is manipulated, but still the spot price is for 400 oz bar not for 0.25oz shipped to your door.....",
    "and i just look it up, you can get one oz for $1826 including shipping and profit for the business that selling it.",
    "but if you want to buy for \"real price of 2100\" i will sell you same......",
    "🤔"
  ]
}
{
  "Title": "What would this be worth 1925 Indian?",
  "Description": "$210 melt, $400-500 retail",
  "Comments": [
    "$210 melt, $400-500 retail",
    "If you don't have too much money into it this would be a great coin to have graded. Local coin shop could send it out for $50 probably. Price jumps alot depending on the grade",
    "i am getting it from my grandma  have no interest in selling it just wondering what it would be worth",
    "Looks like it’s in MS condition, I would try to get it graded for sure",
    "thanks i will be looking into it",
    "Wow that's in great shape. Get it graded for sure.",
    "Nice! When my grandpa passed, my uncle received gramp’s $2.50 gold piece.",
    "yeah im looking forward to it",
    "It's a Quarter Eagle ($2.50) and a 1925-D."
  ]
}
{
  "Title": "Proof vs. Burnished. Tales from the deep stack.",
  "Description": "Both are beautiful in their own way.",
  "Comments": [
    "Both are beautiful in their own way."
  ]
}
{
  "Title": "My new coin arrived. Buying while price is low",
  "Description": "Very pretty coin!",
  "Comments": [
    "Very pretty coin!",
    "The price isn't low. It's close to the all time high, actually. We all just have a reason to belie that it will go even higher.",
    "This ^",
    "It's easy to fall into an echo chamber between Reddit, YouTube, and other forums. The price is incredibly high right now. It's about twice the median for the last 50 years when CPI adjusted and we've no reason to believe it'll do anything other than keep falling.",
    "I appreciate OP sharing his recent pickup but stating that the price is low currently in the title is objectively wrong and just feeds groupthink and poor decision making.",
    "What is a fair price in your opinion?",
    "You smoking something?",
    "Very nice coin.  Might have to get this one in the future.",
    "She is a beauty 😍👍"
  ]
}
{
  "Title": "Best bullion dealer (Europe/Ireland)",
  "Description": "Im just wondering if anyone is from Ireland here and where the best/cheapest dealer is. Im looking to start stacking but so many different sites with varying cost, premiums and delivery. Any help is appreciated.",
  "Comments": [
    "Im just wondering if anyone is from Ireland here and where the best/cheapest dealer is. Im looking to start stacking but so many different sites with varying cost, premiums and delivery. Any help is appreciated.",
    "If you're in Ireland why aren't you just following the rainbow...",
    "Goldsilver.be. They ship swiftly and are reliable, just pay them and don’t push them with useless mails to ask if it can go faster. They are trustworthy, they pack nicely and most important; they have good prices.",
    "Ill check it out👍",
    "Goldsilver.be",
    "Thank you",
    "Yes, I live in Ireland and buy gold.",
    "Before brexit Bullionbypost had competitive prices and very good assortment, but after 1st of january they have stopped selling silver and gold bought from them might have excises put on them.",
    "I am buying from Celticgold.eu now, it's German company where they also offer vat-free silver from Estonia. They also accept cryptocurrencies which is handy if you want to turn your profits into gold. Only downside is they have extremely limited gold assortment, but otherwise they are extremely good to buy from.",
    "Yes i was looking at silver too.. Kinda sucked they dont sell",
    "My website which compares the prices of UK bullion dealers might make it easier for you to see who offers the lowest premiums across gold and silver. I'm sure the majority of these dealers will deliver to Ireland as well with an additional delivery fee.",
    "Interesting may be very helpful. Yes most deliver to Ireland its just i want my money to get the best investment i can. Lets just say something that balances out good so delivery or price of bullion itself dont offset my investment too much."
  ]
}
{
  "Title": "My precious",
  "Description": "Lmfao",
  "Comments": [
    "Lmfao",
    "Love a Pelagos",
    "Everytime I almost buy a Tudor I ask myself: \"Why don't I just buy a Rolex?\"",
    "You should sell your shitters and buy a Seiko 5. Like a man",
    "I wholeheartedly agree with the financial advice offered by my fellow circlejerker. A serious investment portfolio should be composed of >80% Seiko 5. Ok ciao.",
    "I concur",
    "Was trying to figure out if this was ",
    ", ",
    ", or ",
    ".",
    "You are right sober me has banned drunk me from posting for a week",
    "Should have been wallstreetsilver ... 🤣😋✌️",
    "My shameless plug of them silverbacks 50k plus strong 💪now",
    "yes",
    "What is this shit?",
    "Unless they're price matching, APMEX is generally one of the higher priced online PM dealers.",
    "You should check around at places like Hero Bullion, SD Bullion, Money Metal Exchange, etc if you're buying online. You could save some decent money on the premium.",
    "For instance, as of this post (4/11/21) SD Bullion has random year ASE for $34.85 and APMEX is charging $35.37.",
    "Great watches!",
    "Awesome",
    "How do the Todor values appreciate compared to the Rolex? Will be in on a quality investment grade watch sooner or later.",
    "Watches as an investment lmao",
    "Are watches really a good investment?",
    "These are titanium and will likely depreciate. I’ve doubled my investment on a Rolex deep sea in the past."
  ]
}
{
  "Title": "Been lurking here for a while. Feel kind of funny flairing this \"the stack\", but I gotta start somewhere! My first gold and platinum purchases",
  "Description": "Nuggs and platinum? Dope.",
  "Comments": [
    "Nuggs and platinum? Dope.",
    "Sweet bro. Keep on stacking.",
    "Love the nugget ! You got a chain for her ?",
    "Yes, I bought my wife an 18 karat mother's necklace for Christmas. Its a real dainty chain, this lil nug looks sweet on it. I'm looking for something for me now, I think I've got gold fever",
    "The majority of pamp is the real thing its not so difficult to check. Although my friend and I bought a precious metals analyser in America for under $700 money well spent",
    "Nooooooooo. Dude. I just saw on Tiktok that Pamp is a scam and that shit is copper inside. Get it tested!!!!",
    "Link? I’m very curious",
    "Lol...\"I just saw on tiktok\"....come on....",
    "Pamp is not a scam. Pamp is a globally recognized quality brand of precious metals.",
    "Yes, there are counterfeit pamp pieces out there, just like there are counterfeit coach purses, Nike shoes, and Rolex watches. Is Rolex a scam? No. They are top of the line, extremely high end items, and like most premium products, there are counterfeit fakes out there. It has nothing to do with the legitimate brand itself.",
    "Oh boy, there's a scammer born every minute. I'm hoping the counterfeiters don't waste their time on 1 grams, but I wouldn't be surprised",
    "Watch this gold stock St James Gold (TSXV: LORD)(USA-OTC: LRDJF) it was the #1 gainer last week."
  ]
}
{
  "Title": "My first gold coin and goldback. It's not much but I love it.",
  "Description": "I really love the art on the goldbacks, but I don't think they are right for me. Congrats though!",
  "Comments": [
    "I really love the art on the goldbacks, but I don't think they are right for me. Congrats though!",
    "I won't buy any more. It was a few bucks so I added it to my order just to check it out.",
    "💪💪👏👏",
    "Love them both, keep it up.",
    "More than you had before you purchased this.  Earned 🥇",
    "We love it to!"
  ]
}
{
  "Title": "Officially over an ounce of 24k wearable",
  "Description": "Nice stuff 👍👍",
  "Comments": [
    "Nice stuff 👍👍",
    "Mene jewelry looks so good.",
    "Beautiful. Doesn't 24k jewelry get scuffed up too easily? Most jewelry around the world is max 22k or lower.",
    "• it is rare that i take off my mene chain, pendant & charms and they look just like they did in 2017• i do take out the cube earrings most of the time at night, but that's only because they're heavy • they just bought back my mene classic chain & bracelet im gona swap for a narrow flat curb •",
    "Not in Asia. 22K up preferred. Rare to find 18K.",
    "No I’ve never had trouble with 24k jewelry. 22k is reasonable but the narrative that gold is too soft for jewelry is just propaganda perpetrated by the jewelry industry",
    "Very nice.  Jewelry gives the ability to show wealth. Most people are broke and spends most money on convenience.",
    "Mene box chain? I got one myself.",
    "Do you recommend?"
  ]
}
{
  "Title": "Comex gold action",
  "Description": "Anybody care to give the skinny on what’s going on with the comex gold being it’s a delivery month.",
  "Comments": [
    "Anybody care to give the skinny on what’s going on with the comex gold being it’s a delivery month.",
    "paper / digtal doesn't matter if it's fiat.",
    "1930s and modern times may have different contexts.",
    "The price of gold must be so much higher!!! People started to understand that 🚀🚀🚀🚀🚀🚀🥳🥳🥳🥳",
    "The government knows that Americans aren’t going to be dumb enough to hand in their gold again. At least I hope we aren’t that dumb"
  ]
}
{
  "Title": "Hey there, our team just finished creating and translating our website dealing with the topic \"gold\". We would love if you could give us some feedback, thank you in advance",
  "Description": null,
  "Comments": []
}
{
  "Title": "Is gold dropping?",
  "Description": "I have a chance to buy American Eagles at $1825.00 (date of their choice) Is this a good deal or should I wait and see if gold continues to drop?  Thanks",
  "Comments": [
    "I have a chance to buy American Eagles at $1825.00 (date of their choice) Is this a good deal or should I wait and see if gold continues to drop?  Thanks",
    "If it's a major dealer that's a pretty good price on a decent looking AGE currently. Premiums have been over $170 at times. But still too high for me.",
    "Is that through one of those Nationwide Coins ads? I just saw one the other day with a deal like that. Wasn't sure if it was legit.",
    "Didn’t know what you were talking about, so I Googled it.",
    "That has to be a scam. They are selling a 1 Oz Gold Eagle right now for $1945.",
    "I know that people on this subreddit always say how they only buy gold for spot (which I have my doubts that they do), but without premiums, these gold dealers wouldn’t exist.",
    "What would a company achieve by selling gold products for spot? If gold tanked in a week to 1500/Oz, and they bought all their product for 1700/Oz, the company would pretty much be bankrupt before it could even begin operations.",
    "Gold isn’t dropping, spot price is."
  ]
}
{
  "Title": "Gold Standard Corporation rounds. Conrad braun and especially Nicholas Deak intrigue me. This is what ive acquired so far",
  "Description": "These are fantastic! I have a silver one and thought was cool. Little did I know.",
  "Comments": [
    "These are fantastic! I have a silver one and thought was cool. Little did I know.",
    "\"Internationalization\"... I love big words.",
    "Feels weird having the figure looking at me 😳 now I know why they all face the side, feels too...observed..."
  ]
}
{
  "Title": "What price should I ask for a broken gold necklace?",
  "Description": "My aunt asked me to sell off a broken 14k gold necklace for her, weighing in at 10 grams. I was just going to sell it at the straight gold price, but looking around on ebay it looks like similar things usually go for more than that. She's a really nice woman the lockdowns have been hard on financially, so I want to get the best price for her. Thanks for any info.",
  "Comments": [
    "My aunt asked me to sell off a broken 14k gold necklace for her, weighing in at 10 grams. I was just going to sell it at the straight gold price, but looking around on ebay it looks like similar things usually go for more than that. She's a really nice woman the lockdowns have been hard on financially, so I want to get the best price for her. Thanks for any info.",
    "10g 14k is $324.12 melt value. I usually BUY gold jewelry for it's melt value at pawn shops. So if you can sell it for it's melt I would just do that.",
    "Thanks.",
    "Assuming the other guys melt value is right, you may be able to get 330 for it on ",
    " but don't expect that, just expect melt maybe they'll pay for shipping to.",
    "Just remember that ebay charges fees that might bring the total amount you receive down. If it still works out better to sell it on ebay then do that. Whatever gives you the best return is what I'd go for."
  ]
}
{
  "Title": "Please help. Is this real gold? My kids found these rocks by a construction site. I think the rocks are aggregate.",
  "Description": "Press a knife point into one of the spots.  If it flakes, breaks/shatters pyrite.  Sinks in/bends its prob gold.",
  "Comments": [
    "Press a knife point into one of the spots.  If it flakes, breaks/shatters pyrite.  Sinks in/bends its prob gold.",
    "It is most likely iron pyrite, In other words. Fools gold.  Pretty neat find.  Bring it to a jeweller or pawn shop for a test to be sure.",
    "Pyrite, it occurs in slate",
    "Looks like pyrite",
    "Yup, looks like pyrite.",
    "Thanks guys for being brutally honest and destroying my dreams!! Haha it was too good to be true anyway",
    "Pretty rare to find lode gold in slate... like really rare.",
    "If you have a good loup see if you can tell if the stuff has cubic crystals = pyrite... pyramidal crystals = still hope.",
    "Yea I found cubic crystals",
    "What's up Carl! You are one lucky bastard, so I really wouldn't be surprised if it's actual gold.  Definitely try the knife thing that ",
    " suggested.",
    "What’s up Man! Yea I tried it and I still can’t tell. The gold (?) was too hard to break or stab",
    "Most likely pyrites. Gold is most often found in quartz type rock."
  ]
}
{
  "Title": "$5 Early morning flea market find... marked 585 and weighs 31.1 grams.",
  "Description": "What is up with all this...come on now...",
  "Comments": [
    "What is up with all this...come on now...",
    "lol, \"it fell off a truck\"",
    "Thought you had a purty little snek there :)",
    "Yeah, $900 is a fairly decent scrap price for that piece, good score!",
    "Awesome find 🙀 Show us a picture of the 585 marking?",
    "Unfortunately, I ended up scrapping it around 20 min after I took the pic. I was gonna keep it but cash in the pocket is better than around the neck lol. I ended up getting $900 for it.",
    "Should have waited a few months for prices to go up",
    "I’m down wit dat!"
  ]
}
{
  "Title": "Howard Buffett on Gold",
  "Description": "I personally just found out how big Warren Buffetts father was on gold. He fought for years as a congressman to bring the gold standard back. The link is just a speech he gave about gold and returning to honest money, interesting stuff.",
  "Comments": [
    "I personally just found out how big Warren Buffetts father was on gold. He fought for years as a congressman to bring the gold standard back. The link is just a speech he gave about gold and returning to honest money, interesting stuff.",
    "They knew."
  ]
}
{
  "Title": "Bought this beauty with some cypto gains - 0.5 ounce Wiener Philarmoniker",
  "Description": "Beauty! How much did that set you back...? And which crypto did you cash in? No intention to HODL a little longer...?",
  "Comments": [
    "Beauty! How much did that set you back...? And which crypto did you cash in? No intention to HODL a little longer...?",
    "nearly 900€, Iota, for me it was funny whilst it lasted, now at least I have something that I can touch!",
    "Now that's a gold watch!",
    "Is this custom made? Is it legitimately a 1/2 oz philharmonic?",
    "No, the shop assistant told me that it was a limited edition by the Wiener Philarmoniker, I certainly do hope that it is a legitimate oz.",
    "has to be, not hard todo like with the rings ppl make!",
    "I \"think\" it's made in collaboration between Raymond Weil & Wiener Philharmoniker but the hands aren't standard for that model (could well have been changed and that's no slight to the watch)",
    "⌚ TIME FOR MUSIC 🎼",
    "This is really a beautiful piece u got there!",
    "Gorgeous!",
    "She’s beautiful !",
    "This watch, is your birthright",
    "My favorite one !",
    "Awesome buy. You turned a fake asset (crypto) into a real one (gold). In 20 years people will look back and laugh at the crypto mania (how we now laugh at the Great Tulip Bubble or Dotcom bubble), and you will still have a beautiful watch with real value. People have used gold for millennia and will continue to covet it as long as man walks this planet. I can hardly say the same for the plethora of crypto currency out there which may be created at whim out of thin air (and lots of power!).",
    "That's ridiculous. If you can't see the obvious value that bitcoin brings to the world, you must not know much (if anything) about it. The combination of innovations like the blockchain and proof-of-work to build an insanely secure way of storing and transmitting value globally and beyond the reach of any authority was pure genius.",
    "The only good argument against it is \"why bitcoin and not another cryptocurrency if they're so easy to create?\" and I don't have a great answer here, but the 12 past years have been showing that the first-mover advantage is real and massive.",
    "A tool to store and exchange value insanely securely on a global scale and beyond the reach of any authority is so useful that it's never going away. Cryptocurrency is here to stay and it will keep growing.",
    "I'm here because I love precious metals, I started buying gold and silver in 2011 and bitcoin in 2012. I love both and if anything, they're complementary. Precious metals are low risk/low reward while bitcoin is high risk (less and less true)/high reward.",
    "Isn't it obvious that you're making a huge mistake by rejecting bitcoin entirely? Everyone should own at least a little bit while it's so cheap. This is something I told my friends on Facebook in early 2013 when the price reached 100€ for the first time. In terms of risk/reward, it's just dumb to not have at least 0.1 bitcoin at this point, even if you don't like bitcoin for some misguided reason(s).",
    "(and lots of power!).",
    "How do you think your gold is taken out of the ground? Do you have any idea how much gasoline an excavator uses?",
    "Okay boomer.",
    "Hey mate,",
    "nah, crypto is quite real for me, especially BTC, ETH and IOTA. I like to be diversified and with this purchase I further diversified.",
    "Awesome buy. You turned a fake asset (crypto) into a real one (gold). In 20 years people will look back and laugh at the crypto mania (how we now laugh at the Great Tulip Bubble or Dotcom bubble),",
    ".",
    "I presume this isn't something you wear out? I'd be afraid to wear that out."
  ]
}
{
  "Title": "Update for people who have messaged me asking about SigmaBoss availability",
  "Description": null,
  "Comments": []
}
{
  "Title": "Started stacking gold, I’m curious",
  "Description": "Has anyone here ever purchased anything directly with physical gold?",
  "Comments": [
    "Has anyone here ever purchased anything directly with physical gold?",
    "It would be cool to hear stories if so.",
    "Someone posted a video here about a month ago of a libertarian/currency convention and people were only excepting gold, silver and cryptocurrency. I believe goldbacks were the most popular currency at that event."
  ]
}
{
  "Title": "How to profit with gold during economic hardship?",
  "Description": "Hello fellow Goldbugs.",
  "Comments": [
    "Hello fellow Goldbugs.",
    "The question I have is one that I am having a tough time finding an answer to. Many of us are building stacks of precious metals since we suspect the rising inflation and possible hyperinflation of world currencies will drive the prices of gold skywards. Many people know that many millionaires and billionaires were created from such a time as the Great Depression. Price predictions suspect gold will go to $10K per ounce. If this happens well what do we do? Do we profit from this huge price gain and sell for cash? Do we exchange gold for land? Or do we hold onto our gold until after a market crash and sell it for cash to buy cheap stocks, cheap land, and cheap houses?",
    "Thanks for your help in advance.",
    "my way is to have more than just one asset and not to be depended on gold at 10k for retirement........",
    "if you have staff like stocks, bonds, real estate more pm like silver",
    "this way you don't need to try to guess which of them will go up next",
    "all you have to do is sell from time to time the ones that go up and buy the one that go down",
    "this is how the rich get richer and today anyone can trade",
    "gl!",
    "If gold hits $10k an ounce, you know the dollar is toast. You’ll need a sack of cash to buy a pack of smokes.",
    "Could always barter/use it to purchase properties literally for pennies on the dollar. Also convert it into other assets/businesses with potential that have hit the bottom or need a “partner” that you can buy in cheap",
    "Land with livestock",
    "Buy a house. Trade it for whatever will improve your standard of living",
    "once the dust settles use it to buy land and start businesses",
    "Who became a millionaire or billionaire buying gold in the Great Depression? It was illegal to own back then?"
  ]
}
{
  "Title": "Someone suggested I add a Maple to my Britannia, did I do it right? Paid a 45% premium for this 1995 1/20oz 9999 gold Maple Leaf. I guess this is officially a stack now.",
  "Description": "I wish I had a 1/20 maple. I even have the container for it already lol. They’re so hard to find that a 45% premium sounds about right.",
  "Comments": [
    "I wish I had a 1/20 maple. I even have the container for it already lol. They’re so hard to find that a 45% premium sounds about right.",
    "Where did you find a capsule with the black foam? Thx",
    "It came with it, boxed with a certificate so I believe it's original. I've been trying to figure out where to get or make them, would like to get the Britannia into a 39mm capsule.",
    "Taking even less fiat to buy the precious, do get it while you can!",
    "I’ve never heard of that refiner."
  ]
}
{
  "Title": "Just got this beauty in the mail today",
  "Description": "Aw man that's nice. I've wanted one for years!",
  "Comments": [
    "Aw man that's nice. I've wanted one for years!",
    "Yea I think this one is a must have for every stacker out there 👌🏼",
    "Nice, reminds me of the Buffalo I once had, first year issued MS70 and sold it to a friend that wanted to start buying gold.",
    "I keep asking him if he wants to sell it back but now he’s got the fever too.",
    "Ahh yes, my favorite!",
    "I’ve been wanting one of these for a while and I finally got one. I will say it’s a lot nicer than I expected.",
    "nice!!!",
    "Sooooooo nice!",
    "Man beautiful but on a side note is anyone else having delays with the post office geez. I’m waiting on so much heat and it’s soooo slowww.",
    "Thankfully I haven’t had any problems with shipping",
    "Very nice..I have one coming Wednesday from Goldsilver bull",
    "Yea they have great prices there I never knew about that website until someone here told me about it. I saw they had the randoms and I had to order me another one lol",
    "Classic beautiful American coin... Hope they don't ruin it with ugly PC design like they did the AGE/ASEs.....",
    "what did they do to the ASE?",
    "The platinum eagle design is the worst.",
    "All time favorite coin by a mile 😍",
    "Nice! I've been wanting to get one too!",
    "that's .9999 FINE",
    "24kt is nice. Too bad it's ugly.",
    "Idk about ugly, at first I wasn’t a big fan of the buffalos until I saw one in person. I liked it so much I ordered me another one lol so I should be getting it next week. my personal fav though is the gold 50 pesos"
  ]
}
{
  "Title": "First gold purchases.",
  "Description": "Next on the list - 1oz maple (love the look of the new ones with the radial lines) and a full ounce Eagle.",
  "Comments": [
    "Next on the list - 1oz maple (love the look of the new ones with the radial lines) and a full ounce Eagle.",
    "So nice, love that hologram gold, can't wait to get mine in a mail call soon.",
    "It’s a bit of a novelty in 2 grams, but cool for a conversation piece. I’d love to see one of the 100 gram ones.",
    "Nice Krug, online or local dealer?",
    "Congrats. Nice silver bars too"
  ]
}
{
  "Title": "I want to buy gold nuggets got any advice for me?",
  "Description": "I like the Alaskan and Australian nuggets. The only place I know is liquid bullion from seeing them on here. Are there other dealers that sell nuggets that I'm not aware of. I'm looking to start stacking gold nuggets since I have coins and silver bullion and would love some advice.",
  "Comments": [
    "I like the Alaskan and Australian nuggets. The only place I know is liquid bullion from seeing them on here. Are there other dealers that sell nuggets that I'm not aware of. I'm looking to start stacking gold nuggets since I have coins and silver bullion and would love some advice.",
    "I bought a nugget off of Facebook marketplace from California.  I think it’s real.",
    "Ok kool.",
    "Your best bet to buy gold nuggets is direct thru a prospector.",
    "You can find some on eBay Australia or at reputable dealers both in the USA and in Australia.",
    "Cool thanks I'll check that out."
  ]
}
{
  "Title": "Couple more ladies and a big queen",
  "Description": "Those silver ounces are huge hey.  I keep wanting to get a Kookaburra to play with but I worry it's too huge.",
  "Comments": [
    "Those silver ounces are huge hey.  I keep wanting to get a Kookaburra to play with but I worry it's too huge.",
    "That’s a 10 oz kook. Love to buy the giant coins when the premiums aren’t crazy"
  ]
}
{
  "Title": "Please help me identity if this is gold plated. Can anyone determine the markings ?",
  "Description": "Best way probably is to walk into a good jewellery store, and ask them to analyse this in their machine.  It will accurately give you a report on the purity. Seeing a photo is not good enough to suggest anything.",
  "Comments": [
    "Best way probably is to walk into a good jewellery store, and ask them to analyse this in their machine.  It will accurately give you a report on the purity. Seeing a photo is not good enough to suggest anything.",
    "The 750 should mean that its 18k gold, but a jeweler can verify it for you.",
    "What does the E 580 mean 😪 is it electroplated ?",
    "I think it's the manufacturers marque but as mentioned take it to a a jeweler or different one's to be sure.",
    "750 means 18k gold because 24k x .750 = 18k",
    "I dont know what E590 means though. Take it to a jewelry store or pawn shop and test it. Lots of places have gold verifier devices. I have one myself and they are very accurate",
    "750 = 18k gold !"
  ]
}
{
  "Title": "Jack Sparrow, Pirate",
  "Description": "There's zero money problems in his life!",
  "Comments": [
    "There's zero money problems in his life!",
    "Oh a box of $200,000, nice",
    "Why do I have the urge to toss them in the air and make it rain.",
    "Hail?",
    "That’s a few coins. Over $250k easy",
    "Damn pirate has been busy!",
    "Wow oh wowie",
    "Damn Bro 😎",
    "Stacker McStackerson.",
    "Dude, what are those air tites that are circular, yet have a bar shaped holder inside of them? I really need those.",
    "You need a safe lol. Multiple in case 1 is ever found by thieves.",
    "Russian mafia confirmed",
    "Found Putin’s Reddit account.",
    "Congratulations on that awesome stack...... worthy of Mr Wick",
    "I hope that all of your money isn’t in just gold...",
    "Edit:  downvotes for suggesting diversification?  Now I hope you all have gold only as well.",
    "If all his money is just in gold then how he buy more gold?",
    "Baller !!",
    "Gosh dang",
    "I'd like a selection box like that please. 😋",
    "Wow",
    "That’s an amazing collection",
    "Lovely."
  ]
}
{
  "Title": "Test for counterfeits with sound - see comment below",
  "Description": "Hello All! I would love to share my boyfriend’s new product with you. He is active on YouTube, Facebook, and Instagram but he doesn’t use Reddit. So I asked him if I could share it here and he gave me the go ahead :D",
  "Comments": [
    "Hello All! I would love to share my boyfriend’s new product with you. He is active on YouTube, Facebook, and Instagram but he doesn’t use Reddit. So I asked him if I could share it here and he gave me the go ahead :D",
    "This little gadget is called the Pocket Pinger. It is a new way to test for counterfeits, by amplifying the the coin ping test.",
    "Coins and small bars can be placed in the device and then flicked with your thumb to create a ping! This ping will be much more resonant than balancing a coin on your finger or any other current methods. But my explanation wouldn’t be as good as checking out a video! So I encourage you to check him out:",
    "SoundMoneyMetals",
    "Hope you enjoy it! They are coming out in April, barring any delays.",
    "This looks like a really simple and incredibly useful bit of kit!",
    "I'll keep an eye open for them, would he be shipping abroad? Would be really handy having one of these."
  ]
}
{
  "Title": "First 1/4 gold maple :)",
  "Description": "I love that 0.9999",
  "Comments": [
    "I love that 0.9999"
  ]
}
{
  "Title": "My first bullion bar! 2021 Una and The Lion 1oz gold bar.",
  "Description": "Just bought a 2021 Britannia, wish I seen this before.  Very nice",
  "Comments": [
    "Just bought a 2021 Britannia, wish I seen this before.  Very nice",
    "Lets be honest... it is hard to complain about that 2021 Britannia!",
    "I'm a crypto enthusiast but as much as I love both, gold and crypto.  Gold reddit is so much better! Full of positive posts. Crypto is full of jerks, my token is so undervalued, my token is environmentall friendly, why is my token free falling 😴  blah blah blah.",
    "Gold is simple and beautiful!",
    "I don't know why it's beautiful but it is.",
    "So jealous. I just got my 10 oz silver Una and the Lion in the mail from JM. Now its sold out everywhere and I am wondering why the hell I didn't grab it in gold as well!",
    "Hope you like it!",
    "Man, the Apmex eBay store had them available yesterday. I have held off buying and now it is out of stock. Kicking myself!",
    "Nice start man!",
    "2021 Una and The Lion 1oz gold bar",
    "Thanks. I'm really motivated to build a decent stack now.",
    "RM have really outdone themselves on this piece - I really think this is going to prove to be a winner in the future.  It's as much a work of art as it is a piece of bullion...collectors will be clamouring for them in the future.   I can't wait to see the next one in the series!",
    "That is Beautiful... I want one of these!",
    "Thanks. You should pick one up now if you're looking to get one. RM only created 4000, and the RM store only has about 150 left. They're selling pretty fast considering they were just released a couple of weeks ago.",
    "Man, that’s handsome!",
    "Love this one. Good pull",
    "My first 1 oz buy as well. Just stunning.",
    "This bar is a work of art. I usually prefer coins, but this one is an exception for me.",
    "You can. IIRC they don't accept credit cards, only debit or wire transfers. Just FYI, large international debit card purchases tend to automatically get flagged, so let your bank know about the purchase before hand or just do an international  wire transfer.",
    "I just got this gold bar from JMbullion. Unfortunately I seemed to have received an imperfect one. The one I received has a dent in the gold on the head as well as a white mole on the cheek... I think the White mole Might be from the blister pack"
  ]
}
{
  "Title": "My first gold coin, 1/10 OZ.",
  "Description": "Nice!",
  "Comments": [
    "Nice!",
    "Very nice!",
    "Welcome to the club.  It's addictive, you'll have more soon enough."
  ]
}
{
  "Title": "Interested in precious metals",
  "Description": "I’ve grown an interest in precious metals recently. Be it gold, silver, or even platinum. And I just want to ask, how do I start? I recently became an adult and my family gave me a sum of money they’ve been saving up for me(like 2.5K$.",
  "Comments": [
    "I’ve grown an interest in precious metals recently. Be it gold, silver, or even platinum. And I just want to ask, how do I start? I recently became an adult and my family gave me a sum of money they’ve been saving up for me(like 2.5K$.",
    "I heard silver is quite hard to sell but I’m not sure and sorry I’m talking about silver here but there aren’t subs for it.",
    "Should I use all the money and buy gold with it?? Gimme advice y’all I’m kind of lost but genuinely interested and I believe that gold is quite literally the definition of money.",
    "First of all, welcome to the stacking community! Just make sure that you aren’t spending more money on precious metals that you can afford to be without for a long time.",
    "There are lots of decent options to start buying precious metals. You can buy gold, silver, platinum, etc. from major online bullion dealers like JM Bullion, Apmex, Silver.com , etc. You can also buy from your local coin shops, or from eBay (although you have to be somewhat careful about eBay due to the risk of fraud and counterfeiting). If you don’t care about physical, you can buy and sell ETFs like you would stocks, though I do like physical metals for myself.",
    "In terms of difficulty in selling silver, it is not all that difficult in my experience at least. Some shops will try to low ball you on price, but you just need to know what your metals are worth and be willing to walk away.",
    "Also, just a heads up, there are subreddits for silver. ",
    " for stackers and ",
    " for speculation (with some obvious overlap between the two). ",
    " is a great community for precious metals too of course.",
    "Thank you for your welcome:)",
    "Online stuff is quite a hard option for me so I’m stuck with the local fellers lol.",
    "I told my parents about starting to save their money with gold instead of real estate or cash for example. People will ALWAYS sell real estate and offers will always exist but gold will always be the real money so it’s better to keep it as it can be converted to cash quickly as it’s easy to sell and super Valuable.(idk if I’m right or no but I’m trying to be right lol)",
    "Maybe I’ll invest in some silver like a kilogram per year and leave the gold for the actual gainers? Man imagine how epic that would be lmao thinking about owning something like that would make me feel like a real adult lol.",
    "I would like to extend my two cents. First, learn from one of the best experts Mike Maloney. Go to his main site ",
    " and get his free book; \"Investing in Gold and Silver.\"",
    "Also, check Lynette Zang and Peter Schiff; twitter sites and youtube videos.  After you have educated yourself regarding silver and gold; make your first purchases."
  ]
}
{
  "Title": "Au",
  "Description": null,
  "Comments": []
}
{
  "Title": "Mint capsule vs capsule that has no gap",
  "Description": "Hi all,",
  "Comments": [
    "Hi all,",
    "Just want to know where the community stand with coins that come with their own capsules (Perth minth or proof libertad) but has a little bit of space and rattle. So do you leave them in their OG capsule or find a direct fit for them?",
    "The space give me OCD and I usually find a direct fit or one with the black ring so they don't rattle around. With the black rings, I go down size. Ie 34mm for the libertad instead of 35. 32 for AGE.  The maple is good at 30mm.",
    "Do not remove! You will ruin the coin",
    "How will it ruin it?",
    "I personally prefer a tighter fit but hate the black ring. I like to observe my coins from all sides with no obstruction"
  ]
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "HELP! Storage products",
  "Description": "Hello , I need to store my stack a little better for my odc needs and I can’t seem to find any black airtight capsules that are PRECISELY size for at least US. Gold coins not gold rounds",
  "Comments": [
    "Hello , I need to store my stack a little better for my odc needs and I can’t seem to find any black airtight capsules that are PRECISELY size for at least US. Gold coins not gold rounds",
    "but also sovereign’s , pesos , francs ...etc",
    "I would like to also store my bullion rounds in air tights also",
    "So I guess I’m just looking for the best website or source of black airtight capsules and the tubes to store the capsules Thanks in advance friends",
    "Look up what size the coins are In millimeters, and then look up the capsules you need on apmex or jm bullion. Onfireguy on Amazon is also a great place to find tubes and what not.",
    "I did the looking up size part but I only find capsules that are +1/-1 a mm so I envision a miniature gap that makes me wanna vomit 😂",
    "I go -1 with foam capsules fit nice and tight and looks good. The gap killed me too",
    "What specifically are you looking for?"
  ]
}
{
  "Title": "Buying New v old gold",
  "Description": "Hi all.. so excuse me if this sounds like a stupid question but...",
  "Comments": [
    "Hi all.. so excuse me if this sounds like a stupid question but...",
    "Im looking to start buying gold weather it be Coins or bullion from requitable gold websites.. But why would You buy new gold bars or coins over say used gold from a pawn store for example..",
    "Is there any difference or is gold price the same weather its new or used seen as well gold is gold !!",
    "Am i being dumb? What am i missing here?",
    "Any tips !😬",
    "Am I that out of touch, or why would they sell old gold in a porn store?",
    "I just mean used gold on the high street from say a shop..",
    "Lol soz literally just twigged i used the wrong kind of “pawn” to explain my post 😫😂😂😂🤦‍♂️ post has been edited lol",
    "Maybe if you were \"in touch\" a bit more, you'd be able to answer that.",
    "If you're buying bullion, gold is gold. As long as the source is trustworthy, its only about price and premium.",
    "Im uk based.. i bought a small amount from bullionbypost i do trust the site however i dont know if its the best site for price.",
    "Do you have any tips ? Also i see on that site you can buy  (for example) many different 1g bars all minted by different companies.. does the company even matter?",
    "It's all as old as the stars from where it came.",
    "True that!",
    "I prefer to buy gold coins not bars because the ones I buy are made by government mints, these are the most reliable, they are the easiest to sell and they also get the highest premiums. I prefer American Eagles and Buffalos but also have Maple Leafs and Krugerands. The best price (lowest premiums) are from my Local Coin Shop, they are always used but usually in excellent condition. Nowadays the selection is usually very limited but is constantly changing. Visit your local coin stores, talk to the owners, you will see who you like and trust the most. I call my favorite shop sometimes to see what they have, they will put it aside for me, otherwise it may be gone by the time I get there. The market is hot!",
    "Assuming that you can verify that the gold is real, the values should be equal baring damage or wear. It is my experience that pawn shops and coin shops are more expensive than online bullion dealers (barring maybe Apmex) best advice is just to have a way to verify what you are getting.",
    "Thats fair enough... ive started buying off bullionbypost in the uk and its small new bars for now untill i can shop about for other suppliers. As far as im aware they are reputable and trust worthy so im almost confident it will be real and i bought new also as they come in nifty little sealed packing and so on.. Although i have seen some soverigns in my local pawn shop that ranged from just under £100 to around £360"
  ]
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Feels a hell of a lot better than holding a stack of paper dollars.",
  "Description": "Love the LMU! Excellent choices!",
  "Comments": [
    "Love the LMU! Excellent choices!",
    "Don't mine Edward VII in the back he was lonely being the only sovereign in the stack lol",
    "I gave this image of gold a silver award...",
    "I have just gotten into the LMUs. These look great!",
    "Love numistacking LMUs too. However, when you are through the most common French, Italian, Belgian, Russian, etc ones, premiums start to get very steep.",
    "Yeah, but does it feel better than holding computer-generated ethereal bit currencies in your hand?",
    "/snarc : )",
    "Depends on how much is in the ledger now doesn’t it. Gold is amazing to hold and buy with profits from computer-generated ethereal bit currencies",
    "Gold is awesome all on its own. I'll never understand why folks gotta make it be about other things. I hold gold, silver, Bitcoin, Ethereum, hell even some Doge. I'm happy for anyone getting a piece of the pie. Assets come with risks. DD is the key. We live in a time when more and more people are getting into markets and trying to take control of their future. It's an awesome time. 👍",
    "A fist full of ",
    " francs.",
    "Those look great!",
    "Sometimes you can find yourself picking it up out of pure pleasure. And find out that you spent a hour looking at your coins lol",
    "Real Money 👍",
    "Don’t you just love the way those capsules clank together and the feeling of acrylic on your bare skin?😂",
    "Gold (per value) is also lighter than $20 bills.",
    "And $50s but not $100s yet",
    "Beautiful. Where did you get the plastic holders? I may pick some up if they're available.",
    "21mm airtites from Onfireguy.com. I thought I'd like the direct fit more than the ones with black foam rings, but I prefer those.",
    "Gorgeous coins.",
    "Do any of the francs have the big rooster on the back? That is my absolute fav bullion coin",
    "Looks like the first one on the left is a rooster.  My favorite as well"
  ]
}
{
  "Title": "Gold looks better than my handwriting I’m going to all this along with another 10 gram and go get me another 1oz Britannia. I Thought about getting rid of my 1/10 Britannia but I think I’ll keep it",
  "Description": "If u we’re going to advise a family member where to buy some gold where would that be ? I love ur collection but have no clue about the gold game",
  "Comments": [
    "If u we’re going to advise a family member where to buy some gold where would that be ? I love ur collection but have no clue about the gold game",
    "Local coin shop sold me lower than you would get at jm bullion or apmex for sure",
    "Tbh I started with apmex and jm bullion and I mostly buy from bullion dealers Some say to start with local coin shops but I’m not that seasoned to know what I’m looking at from a coin perspective unless I’m getting it from a trusted place like apmex or jm bullion"
  ]
}
{
  "Title": "1/4 ounce 14k. A fine addition to the collection",
  "Description": "Sweet coin! I I wonder why they decided to strike it in a purity as low as 14k as opposed to the standard 22k or 24k.",
  "Comments": [
    "Sweet coin! I I wonder why they decided to strike it in a purity as low as 14k as opposed to the standard 22k or 24k.",
    "Also, the $100 face value is a little silly. The Canadian Gold Maple has a $50 face value and over 4.5x the gold content :)",
    "Thanks! I’m also not sure as to all the oddities. But in the end. Gold is gold"
  ]
}
{
  "Title": "Is it a good idea to buy some 9ct stuff at or slightly above the spot price?",
  "Description": "New to the game. Thanks for your input.",
  "Comments": [
    "New to the game. Thanks for your input.",
    "Depends how slightly over. You can get 9999 bullion at slightly above spot. I wouldn't buy 9k stuff for stacking purposes.",
    "I agree with this. If you stack jewelry why not 22k. Find an Indian, Thai, or Chinese jewelry place and get some there."
  ]
}
{
  "Title": "Jeff Christian vs. TheHappyHawaiian",
  "Description": null,
  "Comments": []
}
{
  "Title": "Jeff Christian vs. TheHappyHawaiian",
  "Description": "Just curious, how much do you get from SS or WSS for spamming all this crap? Or is it just from the goodness-of-your-heart, and  some sort of betterment-of-mankind bullsh!t?",
  "Comments": [
    "Just curious, how much do you get from SS or WSS for spamming all this crap? Or is it just from the goodness-of-your-heart, and  some sort of betterment-of-mankind bullsh!t?"
  ]
}
{
  "Title": "Mining stocks or physical coins? for a young person, which is the wiser choice? or both?",
  "Description": "Ask yourself: “why am I looking into buying gold?” 1st.",
  "Comments": [
    "Ask yourself: “why am I looking into buying gold?” 1st.",
    "If you scored your 1st 401k job and just looking to diversify or hedge against inflation?  Want an affordable dividend and make money in an otherwise overbought market? Or you are looking for something to have in hand in case a solar flare or some other catastrophe? Your answers may be different.",
    "Are you ok with volatility?  Gold can be volatile, but miners move in multiples (as they they trade in multiples of free cash flow) of the base commodity and are even more so.",
    "It’s a very personal choice.",
    "When you have trouble deciding go with both, maybe make a large one time purchase of physical gold and then auto invest into a company that mines that you trust and DCA in."
  ]
}
{
  "Title": "Senior Gold Producers (NYSE: GOLD and NEM / TSX: ABX and NGT ) More Room for Upside This Year",
  "Description": ":",
  "Comments": [
    ":",
    "Newmont’s shares are up 20%, and Barrick’s shares are up 21% since our previous report in February 2021. Both companies reported strong revenue, and EPS growth in Q1, due to stronger gold prices, partially offset by weaker production due to the pandemic.",
    "2021 production and cost guidance provided by both companies remain unchanged. We are maintaining our 2021 projections, but raising our 2022 projections as we have raised our gold price forecast from $1,750 to $1,800/oz for next year.",
    "Both companies maintain healthy balance sheets. Newmont maintains its position as one of the highest dividend yielding gold producers, with a forward yield of 3.2%.",
    "We expect gold prices to strengthen in H2-2021, as inflation kicks in from a global economic recovery. As a result, we expect sector multiples to increase 15% this year.",
    "We are raising our fair value estimates on both Newmont and Barrick. We are expecting total returns (including dividends) of 28% for Barrick, and 10% for Newmont this year.",
    "NEM is trading at a 40% premium over the average EV/R and EV/EBITDA multiples of senior producers, down from 46% at the time of our previous update in February 2021. Barrick is trading at a 33% premium vs 29% at the time of our previous report. We continue to expect both companies to trade at a 35% premium this year.",
    "Read the full report: "
  ]
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Is there an exact formula to determine the value of gold?",
  "Description": "I know that the value of gold is determined by the banks but what are their calculations?",
  "Comments": [
    "I know that the value of gold is determined by the banks but what are their calculations?",
    "Say hypothetically a meteorite with 10,000 tons of gold crashed in the middle of the US. We know the value of gold would go down, but by how much and how is that calculated?",
    "What if aliens were following this gold meteorite and when it crashed they took that gold and more of ours? I think the price would go higher for sure. :)",
    "Wouldn't it depend on how much it would cost to extract and process the gold from the meteorite?",
    "Google says that 187,000 metric tons of gold has been historically mined.",
    "With 10,000 tons of new gold added to supply we would have 197,000 metric tons. If we assume that market capitalization of gold stays the same when increasing supply (which might not be the case in real scenario) and ignore all other variables, then:",
    "187,000 * old_price = 197,000 * new_price",
    "new_price = 187,000/197,000 * old_price",
    "new_price = 0.949 * old_price",
    "So new gold price would be roughly 95% of gold price before meteorite impact, or 5% decrease.",
    "You forgot one factor:",
    "After the farmer told his buddy about the 9,900 tons of gold, he came over to look at the 9,800 tons of gold. They called and explosives guy to blow up the 9,700 tons of gold, so the could haul the 9,600 tons and put the 9,500 tons in a secure place. Then the farmer reported all 10,000 tons of gold stolen to his insurance company.",
    "My guy thank you so much! This is everything I asked for!!",
    "So that would be so that would be 20millon pounds so about 435 billion usd dollars if people knew about it the. I think the price would drop but would the gold be the same price as the space gold ?? But most likely if it did crash I don’t think people would tell you it was gold"
  ]
}
{
  "Title": "Advice on buying gold coins?",
  "Description": "I’ve thought about investing my savings into gold coins for years and now it makes more sense now than ever with what looks like inflation and a crazy economy. It’s not a lot of money but you have to start somewhere.",
  "Comments": [
    "I’ve thought about investing my savings into gold coins for years and now it makes more sense now than ever with what looks like inflation and a crazy economy. It’s not a lot of money but you have to start somewhere.",
    "I’m trying to learn about how stacking coins works.",
    "On JM bullion the coins say there 1 Troy? oz with a face value of 50$? (Why 50$?) That are .9999 pure gold. Anything I should know?",
    "Do people often only stack one type of coin? British, American, Indian American? Are they all the same diameter?",
    "Why are some in cases and some not?",
    "Do you store in a tube / case because there fragile and to keep pristine or because other reasons?",
    "There is no sales tax on bullion correct?",
    "Thanks for any answers / advice!",
    "I know for the government issued coins they have a face value to make them legal tender, but if you sold the coin to the bank for $50 there's something wrong with your head lol. Maybe if they somehow went back to a gold standard where gold was 50 an oz. But that ship has long sailed.",
    "Premiums are typically smaller on larger coins. Here in Canada, most our 1 oz maples are $75-150/oz over spot price.",
    "The smaller 1/10 oz gold coins carry a $40-80/coin premium which can equate to $400-800/oz (10 x 1/10 oz coins)",
    "The bigger the coins, the smaller the premium but typically a bit harder to sell.",
    "I loved starting off with 20 franc coins. History + gold = interesting.",
    "Here in Canada, anything .999 is tax exempt, the krugerrand and American eagle are 91.67% gold (still contains 1 full oz in a 1 oz coin) but because it’s not pure, we have to pay taxes.",
    "Since the title of your post is gold coinS (plural) meaning more than one, also consider looking at a safe or safe storage locations. Protect your wealth with gold but protect your gold with safety."
  ]
}
{
  "Title": "Gold bar blemished - keep or send back?",
  "Description": "I got this 1oz Perth mint gold bar, primarily because I thought it was cute. However I was a bit less impressed when it arrived, you can see that the finish on the top/right side is matte and the writing on the top half is discolored compared to the bottom half. They were sold as new so not sure whats going on. Anyhow, should I keep it or send it back? Do people here find it acceptable? Does it affect sale price? Thanks.",
  "Comments": [
    "I got this 1oz Perth mint gold bar, primarily because I thought it was cute. However I was a bit less impressed when it arrived, you can see that the finish on the top/right side is matte and the writing on the top half is discolored compared to the bottom half. They were sold as new so not sure whats going on. Anyhow, should I keep it or send it back? Do people here find it acceptable? Does it affect sale price? Thanks.",
    "Personally,  I appreciate the uniqueness and would keep it.   That being said I don't have any high premium pieces and hate the plastic and other packaging in some stacks.  Give me the raw, sexy metal.",
    "It's fine and has character.",
    "Totally normal for cast bars. It's why I love them, they have character.",
    "no , its a cast bar . they all look different,and totally normal.",
    "Cast bars always have some blemishes and it doesn’t affect the price.",
    "Compared to some yours seems a bit scruffy",
    "Then again there are a few like yours...",
    "  ...WalMart??",
    "Fire up the buffing wheel :)"
  ]
}
{
  "Title": "£500+ of Real Money 😍",
  "Description": "Beautiful.. I’m waiting on my first 1/4 oz Brit to ship",
  "Comments": [
    "Beautiful.. I’m waiting on my first 1/4 oz Brit to ship",
    "I had to buy two because well.. why not 😂",
    "Where did you buy yours from?",
    "Looks great I’m looking at getting some sovereigns too to go with the Britannia’s (when I’ve moved house, money is going there this month)",
    "Consider also the quarter ounce “Gold Standard” coins.",
    "Great I have just hot my first half sov but I'm sure I'll get more over time",
    "Excuse me, that's only .35 oz. Your several hundred pounds off.",
    "Sorry, I make bad jokes when I'm jealous of thing :)",
    "\"46 pounds per gram\"",
    "Some things make sense in the UK and not in the US",
    "Very nice choices. Great design and 1/4ozts are a nice size.",
    "Absolutely gorgeous 😍",
    "Very nice where did you get your 1/4 ounce from?",
    "inbox me",
    "Awesome,keep on stacking……",
    "thank you",
    "Love the English coins though. Even more than the Perth mint.",
    "I really want something from the perth mint but I cant justify anything thats not cgt free here in the uk",
    "Yeah, that's real money right there.. not that paper currency nonsense."
  ]
}
{
  "Title": "50 gram 14k chain. Cat approved.",
  "Description": "That chain is dope.",
  "Comments": [
    "That chain is dope.",
    "Thanks! My wife says it’s gaudy but I just really like gold lol.",
    "Cats are cool..."
  ]
}
{
  "Title": "[OC] If you're saving for retirement, a mix of gold and stocks is better than either asset individually.",
  "Description": "I’m hoping the admins will let me leave this post up despite rule #6 as I think it shows the case for gold in a language your average ETF investor can understand.",
  "Comments": [
    "I’m hoping the admins will let me leave this post up despite rule #6 as I think it shows the case for gold in a language your average ETF investor can understand.",
    "If you’re looking to retire, you’ll have fixed living costs regardless of how the market performs. This is incredibly bad news because if the market crashes, your fixed cost will be a greater percentage of your portfolio leaving even less money to compound as the market recovers. Purchasing two assets that negatively correlate each other prevents market crashes from effecting your retirement portfolio in this way.",
    "The pink line represents a portfolio in the ratio of 2:1, S&P500 to Gold rebalanced at the start of each year. At a withdrawal rate of 5.2%, it maintains the initial investment value in 100% of the sampled years. The S&P500 alone maintains the initial investment in only 75% of years, and gold in only 65%.",
    "It’s also worth noting that any of the three strategies perform better than just leaving the money in a bank account so continue to do what you love!",
    "That's a nice share. Thanks.",
    "Not the clearest picture, should scroll down to see the second chart.",
    "Including Dividends: Total Return Stock Index Graph",
    "Does this include periodic rebalancing?",
    "Yes. I rebalanced on the first day of each calendar year.",
    "I do stocks and crypto and am starting to get into gold too.. i plan to use crypto gains to buy gold and possibly watches like used rolex and so on. Does anyone else in here have a similar plan they are already doing or tips and tricks they can share. 😉"
  ]
}
{
  "Title": "Getting the gold!",
  "Description": "Where? We can do this within 5 miles of where I live (Co) but is placer gold and from what I have heard like 8 hours of panning may get you a 1/4 gm or so. Seems more of a hobby thing around here, not a way to make money with the hours you put in. Maybe if you're retired and hate golf and people, so I may do it then.",
  "Comments": [
    "Where? We can do this within 5 miles of where I live (Co) but is placer gold and from what I have heard like 8 hours of panning may get you a 1/4 gm or so. Seems more of a hobby thing around here, not a way to make money with the hours you put in. Maybe if you're retired and hate golf and people, so I may do it then.",
    "It is a hobby. Don't go in thinking you are going to make a fortune. You may get 2.00 dollars an hour.😂",
    "you need a bigger pan...   old timers used to make square ones.. huge.. like the size of dumpsters.. they would rock back and forth...  to process more per hour",
    "More salted \"paydirt\"?"
  ]
}
{
  "Title": "Got a new pinky setup today. 10k white gold with tigers eye and 4 diamonds. 7.8 grams",
  "Description": null,
  "Comments": []
}
{
  "Title": "The year the U.S. was taken off the gold standard",
  "Description": "Can someone ELI5 for an economics noob ?",
  "Comments": [
    "Can someone ELI5 for an economics noob ?",
    "The biggest problem with the gold standard was that if you wanted a bunch of money for something, you had to have the actual gold on hand or your money was suddenly worthless. For normal day to day business that was restricting, you actually needed a somewhat balanced budget. It really started to hurt however when it came to waging war. War is expensive! And it was getting much more so in the 20th century. It was no longer about just a musket and supplies each soldier needed. Now we were getting into bigger guns, tanks, airplanes... As the different kinds of weapons of war increased so did the cost. And this was the reason why many empires collapsed. It's hard to make farmers suddenly produce gold when it comes time to wage war.",
    "So we moved to a Fiat currency. That's a type of money that only holds value because people believe in it. It is backed not with gold, but the actual holdings of the government and the belief that it's issuing government would stay strong and in turn lend strength to the value of that currency. This type of money has it's own different set of issues. It isn't limited to physically needing the gold there to make more. However if you make too much, you can fall into the trap of inflation, or even hyper inflation. Inflation like what is currently happening in the United States is when the \"cost\" of everything goes up fairly significantly over a short period of time. When the value of a home goes up, typically people are happy, \"Yeay!!! My house is worth more now!\" They can still buy everything else at roughly the same value, but if they decide to sell their house, they can now afford more, 'other stuff'.  When the value of everything goes up, what's happening is it's the actual dollars value that is falling. The same dollar today, buys less square footage of house vs what it could yesterday. It also buys less wood, less candy, and a smaller car. It isn't that the price for everything goes up, it's that the value of the dollar falls.",
    "That's about how I'd explain it to my 6 year old, and there's a lot more depth that goes into each aspect of this, but it's a bit more accurate than the other big comment explaining things for you I saw.",
    "Basically, afaik, all the countries that were on the gold standard used an exchange rate that had a fixed price for gold and then your individual country’s money was valued against that based upon the price of gold for you. So if in country X gold is $10/oz, but in country Y it’s $15/oz they’d say that that $10 from X is worth $15 from Y, so one X dollar is worth one and a half Y dollars.",
    "This had a limiting effect on the governments ability to just add or remove money to/from the economy to fight inflation, as adding more money, or reducing it, would affect the price of gold and thus the value of your country’s money against everyone else’s. Now it is more a free floating value that I don’t pretend to understand.",
    "The pro of the gold standard was a more stable economy, the pro to leaving the gold standard is the government having more control over the economy with fewer repercussions than before.",
    "I’m sure I got this wrong, but fortunately that usually brings out the Redditor who really knows the stuff.",
    "Real means it's adjusted for inflation. Real wages vs real earnings: earnings is take home and wages is full compensation. So all benefits including things like Healthcare go into wages, but not earnings. CPI means they're using purchasing power to adjust for inflation, where as the gdp deflator is based on something else (maybe productivity, not sure).",
    "I think OP is trying to make some ignorant attack on fiat currency, but whatever.",
    "One important take away here is that it shows fairly well why the \"wages in the US have stagnated\" argument isn't true.",
    "For one, earnings are not wages. The ballooning costs of other benefits (like our out of control healthcare) are eating up potential earnings. Secondly people are adjusting for inflation 2 different ways and comparing, which is wrong and gives you widely different adjustments. When you adjust wages in the same way you adjust productivity (like gdp here), wages and gdp map much more closely.",
    "There still is a gap, but wages aren't stagnant and they map a lot more closely to productivity than people think.",
    "Conspiracy garbooge.  Might as well replace the title with \"The year the first email was sent\" or \"The year US oil production peaks\" or \"The year NASDAQ debutted\"... and then let people's minds whirl.  Personally, I blame the trend on the opening of the Aswan High Dam in egypt.",
    "The rate of real GDP per capita increases about the same but the rate of others relative in terms of their share of that growth is diminishing. The difference in rates suggests the various scales of exploitation.",
    "The US standard is more valuable than gold. The gold standard was holding us back. So long as the whole wide world believes in USA. USD is better than gold.",
    "Someone should really pin \"CORRELATION != CAUSATION\" on every single surface of this subreddit.",
    "Yeah, I think union busting has more to do with the stagnent wages than the gold standard",
    "You know, I might just get that tattooed.",
    "Yeah but causation causes correlation and correlation is correlated with causation.",
    "Every time this is posted to reddit someone has to disprove these claims. We need a bot that replies with disclaimers every time this link is posted on any subreddit.",
    "Remember, the 70's and 80's were a very radical time in terms of new economic ideals and policies. It's still hotly debated how much leaving the gold standard affected these indicators, if at all.",
    "If there's a hot debate by credible subject matter experts whether this trend was caused by changes to the gold standard, I'd be interested to read it.  Certainly a lot of facebook posts about this nonsense though.",
    "I've never gotten the fascination with the gold standard. It's another commodity, not even that useful of one, it's main value is it scarcity. Tying your currency to a limited commodity is a recipe for deflation. Are there issues with modern currencies? Sure, but they're not going to get fixed by going back to the good standard.",
    "You're right, Doge it is.",
    "US Currency has been on the 'nuclear bomb standard' for a long while anyway.",
    "Under the gold standard the US dollar was overvalued, which led to inflated standards of living. The US gold reserves had dropped by more than half during the 1960s. It was unsustainable.",
    "I doubt things would have turned out much better if the US had just devalued the US dollar relative to gold (which was done, but only half measures before being dropped) as that still would have led to a relative drop in wages. There were also a lot more forces at play, such as the rise of neoliberal economic policies, dismantling of unions, increased foreign competition, etc.",
    "Not to mention that women began to enter the workforce in large numbers. Real GDP per FTE continuing to go up while real wage per worker bogs down is exactly what you'd expect to see with a large increase in the labor pool."
  ]
}
{
  "Title": "Gold standard.... wish it was back.",
  "Description": "The gold standard is one thing (which cannot be done anymore because not enough gold is being produced to keep up with our economy) but what you are seeing here is the price fixing of gold to keep it from running away due to artificial demand.",
  "Comments": [
    "The gold standard is one thing (which cannot be done anymore because not enough gold is being produced to keep up with our economy) but what you are seeing here is the price fixing of gold to keep it from running away due to artificial demand.",
    "If you took all the precious metals combined it would not come anywhere near our currency. And they would become prohibitively expensive for industry."
  ]
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Sovereigns finally arrived! Adding these beauties to the stack 👌🏼",
  "Description": null,
  "Comments": []
}
{
  "Title": "Let me be franc with you",
  "Description": "That one really drachmai up!",
  "Comments": [
    "That one really drachmai up!",
    "Need some napoleons.",
    "Now that’s comedy gold"
  ]
}
{
  "Title": "Gold finally broke 1850",
  "Description": "Let's see if it can hold?",
  "Comments": [
    "Let's see if it can hold?",
    "I have mixed feelings about this. I want it to stay low so I can buy more, but I also want it to increase so that the gold I already have is worth more",
    "I kindda felt the same way but the premiums that I am being asked to pay are toooo high. I use to do US coins at spot for $20/ a couple % for $10 and 10% for $5.",
    "Now it's like 10%/ 20% / 30%",
    "I feel the exact same",
    "does it really matter what the price it is when you are holding, only what it is when you want to sell =D",
    "Finally? It was up around $1925 ten years ago. Over $2050 in 2020.",
    "1877.1 would help me out with my futures a ton this morning",
    "Not yet. Let's just hold above 1850",
    "Some investing podcasts I've listened to made predictions that we will get above 2000 before year's end. I've also been hearing about this supposed second bull run on gold for the last six months that seems be underway now so who knows.",
    "I'm not done buying yet so if it wants to go back down, that'd be cool.",
    "Though I did pick up an Oz a month ago and I'm already seeing like $100 appreciation.",
    "I was pleasantly surprised when I woke up this morning. I’ve bought as much as I could throughout last week, so I’m hoping things keep looking North",
    "I'm with you...did the same.",
    "It broke its 200 day moving average.  If it holds and forms a golden cross, it will attract the technical crowd.",
    "If that happens, may be awhile before another buying opportunity.",
    "Or a good time to unload some under performing mining stocks.",
    "Good point, thanks",
    "Ok let's.",
    "Wheeee... this is fun!",
    "Shoooo hold? To the moon baby!"
  ]
}
{
  "Title": "Always need a silver piece to match the gold",
  "Description": "Beautiful collection! I’ve been doing the opposite (trying to get a matching oz of gold for each type of silver coin I have): ",
  "Comments": [
    "Beautiful collection! I’ve been doing the opposite (trying to get a matching oz of gold for each type of silver coin I have): ",
    "Nice! I feel like that would be a lot harder to accomplish considering there’s a lot less kinds of gold than there is silver, not to mention the cost difference haha",
    "Nice reminder that gold is a lot heavier than silver. Great stack"
  ]
}
{
  "Title": "137 grams",
  "Description": "That is a really neat piece!",
  "Comments": [
    "That is a really neat piece!",
    "Front half looks like an angry whale.other half looks like golden frogs... nuggets like that usually sell way over gold value.. great piece",
    "Doggy!",
    "Wow. XXL Picker!  Did you acid out the matrix?",
    "These are like Australian chunks my man what region are you finding these in?",
    "I am usually happy when I hear the a nugget go \"tink\" when I drop it on my gold pan that one would go \"CLUNK!!!'"
  ]
}
{
  "Title": "Some guy on YouTube told me I should own 3 oz of gold. I, a self-proclaimed free-thinker, promptly did as told.",
  "Description": "It’s crazy the difference between 90% and four nines.",
  "Comments": [
    "It’s crazy the difference between 90% and four nines.",
    "That’s what I was thinking",
    "TIL that Buffalos are more pure than AGEs",
    "91.6%",
    "I’m telling you to get more, so do it!",
    "Sounds like ",
    " going around causing mischief.",
    "The set up does seem suspicious",
    "LOVE THIS 😄🔥",
    "I like the roman numeral AGE's!",
    "Why exactly 3 oz? Im curious",
    "3oz of your particular country’s coin is easily liquidated in an emergency and 3oz of gold can get you out of a financial tight spot.",
    "2is1 (the YouTube guy referenced in this post) teaches to keep 3oz of gold as an emergency fund of sorts, and three one ounce coins of your governments mint is a lot easier to trade for fiat than speciality 1/10ths or foreign coins, especially if you don’t live in or near a major city.",
    "For example, in America a 1oz AGE is easier to liquidate than ten 1/10th oz  queens beasts",
    "The YouTube channel “2 is 1” (he’s also on Reddit, and this post is a giant semi-trolling shoutout) talks about gold, and something that comes up a lot is this goal of 3 ounces. The reason given for 3 ounces in particular is that it happens to be enough stored value to cover a lot of different emergency expenses. He also stresses having it in a liquid, easy to sell form, which usually means whichever bullion coins are produced by your country’s government. I live in the US, so US mint coins make sense.",
    "I can personally attest to that since I traded in a half ounce to get one of those 1 oz eagles pictured above and they didn’t really ask questions, they just gave me an offer (which was like 8% above spot) and I paid the difference.",
    "It might be appealing to buy foreign coins or bars or private mint rounds for the low premium or because you like some cheesy design, but when it comes time to sell you might find that there aren’t as many buyers interested or you might get some real lowball offers. Local government backed bullion on the other hand is often more expensive with higher premiums but they’re always in high demand so coin shops will happily buy them off you. Plus you’ll often get better than spot for them so you end up getting some of that premium back anyway.",
    "I have 6 Oz Krugs cause I thought John Wick was baller with them. #lastoftheoriginals",
    "1 ounce gold for each year of your age plus 15 ounces of silver for each year",
    "Never hurts to own some gold!",
    "What causes the major color difference with the eagle and the Buffalo",
    "American Gold Eagles are 22k and Buffalos are 24k. Same amount of gold in each coin (1 ozt) but the American Gold Eagle has some silver and copper in it to make it harder and more scratch resistant.",
    "Mr. Cool photographs his gold coins on a background that's almost the same colour as his coins, and he always makes sure to include his pocket knife and his playing cards in the shot, because those are just some of the standard cool things that Mr. Cool has with him around the house.",
    "there is nothing wrong about owning x ounces of gold but calling yourself a free-thinker after following a Youtuber's advice is ridicioulus.  You go ahead and do as you're told...."
  ]
}
{
  "Title": "Some guy on YouTube told me I should own 3 oz of gold. Am I doing this right?",
  "Description": "I love rooster’s, beautiful 😻 bird’s",
  "Comments": [
    "I love rooster’s, beautiful 😻 bird’s",
    "Symbology behind these coins: the rooster is the unofficial symbol of the French nation, and the Marianne of the French state (specifically, the Republic). The Marianne is on the obverse. So these coins joined the two.",
    "Marianne is a supposedly a reference to two common names during the French Revolution: Mary and Anne. The image of “Marianne” with this common-person cap was a symbol of the revolution.",
    "What have I done",
    "You've got to know the rules to break them. Carry on...",
    "👆😉",
    "Boy that's pretty!",
    "Thanks 🙌! The LMU coins are my first and true gold love",
    "Deee---eee--eeecent!!!!!!!",
    "Are you a Tim by chance? I ask because of the Dinosaur Attacks cards.",
    "Finally! I was hoping to find a fellow Tim with this post! 🙌",
    "Need one more to push you over the line!",
    "Dammit, I knew a math nerd would come in here eventually and ruin my symmetry",
    "That depends!",
    "A friendly trolling of ",
    ", who is so hard on those lovely roosters!",
    "It depends on how much you paid for them",
    "Your math sucks but you are an investing genius. So ya, it checks out 👍",
    "Ya gonna come at me like that for 2.99oz gold? Harsh😝!",
    "a sheep with 3 oz of gold is still a sheep."
  ]
}
{
  "Title": "Got my first gold maple in the mail today 🍁",
  "Description": "Great 👍",
  "Comments": [
    "Great 👍",
    "Now you actually have wealth, careful it also contains a known ailment that eastern or western medicine has no cure for.",
    "Beauty - Great job!"
  ]
}
{
  "Title": "Interested in gaining a new perspective on things? Check out the r/askreddit subreddit!",
  "Description": null,
  "Comments": []
}
{
  "Title": "Attention new members of r/Gold - Read the rules before posting!",
  "Description": "Recently there have been an influx of new members and rule-breaking posts, so I want to make this clear: ",
  "Comments": [
    "Recently there have been an influx of new members and rule-breaking posts, so I want to make this clear: ",
    " is primarily dedicated to stacking physical gold. If you try to promote pumping prices, \"raiding\", \"squeezing\", or generally any other pump-and-dump scheme, it will be an immediate ban. This is spam, and is not welcome in this community.",
    "Please read the rules before posting and don't be a dick.",
    "THANK YOU",
    "Is this going on with gold as well or is this another place the Wall Street Silver people have worn out their welcome?",
    "This sub has blown up over the years. When I joined, there was maybe a post a week. Now there’s spammers and bans. Time has changed",
    "Edit - I feel like ",
    " and ",
    " are what ",
    " used to look like",
    "YES !!",
    "I do understand these (posting)barriers between subs  ",
    "/Gold.  Fair to note both are angled at physical accumulation, both members are subject to the price throws of PM's. The shortage of bullion isn't gonna be caused by WSS, the general population of many civilized nations are buying what is safe to hold. Fair notice to mods on this sub, a billboard campaign is underway(WSS) with even the slightest amount of success this sub will be picking up members.  Newcomers will not be privy to the rules i think a gentle hand would benefit this sub.",
    "Anyhoo,  best to all.  I couldn't tell you the first time I acquired gold I was that young, the metal does cause a sickness tho.... What humans do while under it's duress in the past and present will surprise many.",
    "Agreed. I saw a new stacker post an ASE on silver bugs, he mentioned he bought it on raid day. They tore him apart in the comments. I imagine did more harm than good in that case.",
    "These subreddits have barely any activity. They are on life support. Making restrictive rules like this is counter productive.",
    "Its like they want their sub to be a tiny little exclusive club they can control. Weird isn't it? Don't really understand it but let them do their thing I suppose. Yes I own gold and I was going to come here to ask a question about buying more but meh...",
    "Gold and silver will always be connected. Right now there is a movement happening with silver, and it will take gold with it. I have been a member here, and ",
    " long before any of this started. As people are attracted to Reddit to learn more about silver, many will join here too. Hopefully soon there will be a subreddit that suits their needs.",
    "Wait for it 1782! ! !",
    "Wow, first time on site! Maybe a little less crack swapped for a cold steini pure would help the relationship and riffs between gold and silver commentary! The humans in the world are being tested on many levels. Hedge bets with both silver and gold, have cash for when the stocks bleed out, and remember... Be nice, drink cold beer and dream of being in New Zealand! Kia Kaha",
    "So where do I find the rules?"
  ]
}
